{"query":{"0":"What is the purpose of the Public Works Contracts Training Manual?","1":"What is the purpose of the Public Works Contracts training manual?","2":"What is the purpose of this manual?","3":"What is the purpose of the course?","4":"What are the main features of the new forms of contract?","5":"What is the purpose of the exercise?","6":"What is the purpose of the Capital Works Management Framework?","7":"What is the purpose of the new forms of contract?","8":"What are the new forms of construction contracts?","9":"What is the purpose of the new forms of construction contracts for public works?","10":"What is the purpose of the new forms of construction contracts?","11":"What are the key differences between the new contracts and those previously used in their sectors?","12":"What are the key differences between the new forms and those previously used?","13":"What are the main features of a public works contract?","14":"What are the main features of a contract?","15":"What are the key changes from the old contracts?","16":"What are the key changes from the Old Contracts?","17":"What are the key changes from the old contract?","18":"What can be done to reduce the risk of contaminated soil?","19":"What is the best way to deal with a contaminated site?","20":"What is the best way to deal with contaminated soil?","21":"What does the new design-and-build contract mean?","22":"What is the definition of a delay or compensation event?","23":"What is the definition of a delay?","24":"How should a Contracting Authority allocate archaeological risk to the Contractor?","25":"How should a Contracting Authority allocate archaeological risk to a contractor?","26":"What is the purpose of a enabling works contract?","27":"What are the main topics of the Public Works Construction Contracts Training Manual?","28":"What are the most important factors to consider when selecting a procurement strategy?","29":"What should be considered when deciding on a form of contract?","30":"What should be considered when deciding on the form of contract?","31":"What should be considered when deciding which form of contract?","32":"What are some of the issues that need to be considered in the Public Works Construction Contracts Training Manual?","33":"What are some of the issues that need to be considered in the Public Works Construction Contracts training manual?","34":"What are the main issues that need to be considered?","35":"What are the main changes in the new forms of contract?","36":"What are the main issues that arise with the introduction of the new contracts?","37":"What are the main issues that arise with the introduction of new contracts?","38":"What does the Department of Finance National Public Procurement Policy Unit do?","39":"What are the duties of the Employers Representative under the Conditions of Contract Clause?","40":"What are the duties of the Employers Representative under the Conditions of Contract?","41":"What do you do after Substantial Completion?","42":"What is the purpose of the contract?","43":"How does the Formula Fluctuations Method (PV2) work?","44":"How does the Formula Fluctuations Method work?","45":"How much of the WYZP will be recovered in an interim certificate?","46":"How does the Hyperinflation Formula work?","47":"What is the purpose of the Letter of Acceptance?","48":"What does the Letter of Acceptance say about post tender clarifications?","49":"What is the purpose of the contract?","50":"How long does it take for a Section to be completed?","51":"How long does it take to carry out a snagging job?","52":"How long does it take to carry out the snagging?","53":"What is the definition of \"weather event\" in the Schedule?","54":"What is the purpose of a Public Works Construction Contracts Training Manual?","55":"What are the requirements for a public works contract?","56":"what does a novation and guarantee deed mean?","57":"What type of information should be included in the Public Works Tender Document?","58":"What is the purpose of a construction contract?","59":"What is the purpose of the construction contract?","60":"What is the definition of a contractor's personnel?","61":"Who is responsible for damage to the Works after Substantial Completion?","62":"What is the difference between a traditional contract and a public works contract?","63":"What is the minimum indemnity limit in respect of Public Liability insurance?","64":"What is the minimum indemnity limit in the Schedule?","65":"What is the difference between a professional indemnity and a personal indemnity?","66":"What does a co-insured contractor do?","67":"What is the responsibility of the Contractor to make sure that the Works Proposals comply with the Works Requirements or Legal Requirements?","68":"What is the responsibility of the Contractor to make sure that the Works Proposals comply with the Works Requirements?","69":"What can be done to ensure that the Contractor is aware of all relevant dates from the ER?","70":"What can be done to ensure that the Contractor is ready for the information or the works item?","71":"What can be done to ensure that the Contractor is ready for the information?","72":"What does the Contractor have to do to keep the ER fully informed about its arrangements?","73":"What does the Contractor have to do to ensure that rates of pay and conditions of employment comply with law and with any registered employment agreement?","74":"What does the Contractor have to do to ensure that rates of pay and conditions of employment comply with law?","75":"What does a novation of a contract mean?","76":"What does the ER have to do if he wants to remove the Specialist from the Site?","77":"What does the ER have to do if he wants to remove the Specialist from the site?","78":"What is the difference between a design and construction contract and a design and construction contract?","79":"What is the difference between a Design and Construct Contract and a Design and Construct Contract?","80":"What does the contractor have to do to ensure that the Works are fit for the purpose for which they were designed?","81":"What does the contractor have to do to ensure that the Works are fit for their intended purpose?","82":"What does the ER have to do if a defect is found?","83":"What does the ER have to do if a defect is found in the Works?","84":"What does the ER have to do if a defect is discovered?","85":"What can the ER do to deal with defects?","86":"What does the ER do when the works are not completed?","87":"How long does it take for a contractor to give notice of the starting date?","88":"How long does it take for a contractor to give notice of the Starting Date?","89":"What questions should the employer ask the Employer to consider?","90":"What does the ER have to do to suspend the Works?","91":"What does the ER have to do to stop the Works proceeding?","92":"Who is entitled to an extension of time under clause 9?","93":"How much of the Programme Contingency has been used up?","94":"How much of the Programme Contingency is used up?","95":"How long does the ER have to respond to a claim?","96":"How long does the ER have to respond to a proposal?","97":"What does the ER have to do in relation to delay claims?","98":"What is the purpose of the Pricing Document?","99":"Who is to be compensated for a delay in construction?","100":"What is the purpose of this section?","101":"How long does the ER have to respond to a claim?","102":"How long does the ER have to respond?","103":"How does the ER calculate the amount due for unfixed works items?","104":"How does the ER calculate the amount due for unfixed works?","105":"Who is entitled to deduct the retention percentage from Interim Payments?","106":"Who is entitled to deduct the retention percentage from the Interim Payments?","107":"what is the purpose of sub-clause 5?","108":"What are the reasons for a termination of a contract?","109":"What are the reasons for termination of a contract?","110":"What are the main reasons for termination of a contract?","111":"What are the consequences of termination for default?","112":"What is the most important thing that the Employer should do when completing the Works?","113":"What is the most important thing that the Employer should do when terminating the Works?","114":"What should the Employer do in the event of a termination?","115":"What should the Employer do in the event of a termination of the Contract?","116":"What should the Employer do in the event of a termination of the contract?","117":"What should the Employer do if he is not entitled to terminate?","118":"What should the Employer do if he is not entitled to terminate the Contract?","119":"What are the consequences of not complying with the notice provisions?","120":"What should be considered when considering the form of bond to be furnished by the Contractor in exchange for payment on foot of the recommendation?","121":"What does the contractor do before entering into the Contract?","122":"what does the contractor do before entering into the Contract?","123":"what does the Contractor do before entering into the Contract?","124":"What does the Contractor do if it terminates the appointment of a project supervisor?","125":"Who will be responsible for the correct positioning of all parts of the Works?","126":"what does the contractor have to do in order to complete the Works?","127":"what does the contractor have to do in order to complete the works?","128":"What can be done to terminate the Contractors obligation to complete the Works?","129":"Why not a guarantor if the parent company has been identified?","130":"what could affect the cost of designing, executing and completing the works?","131":"what could affect the cost of designing, executing and completing the Works?","132":"Who is to be appointed project supervisor for the construction stage or the design process?","133":"what is the cost of a replacement project supervisor?","134":"What does the Contractor represent and warrant to the Employer?","135":"What does the Contractor submit to the Employers Representative?","136":"What does the contractor submit to the Employers Representative?","137":"Who shall be responsible for the correct positioning of all parts of the Works?","138":"what does the contractor give to the Employer before the starting date?","139":"what does the contractor give to the Employer before the Contract Date?","140":"How can the employer terminate the Contractors obligation to complete the Works?","141":"How can the contractor terminate his obligation to complete the Works?","142":"How can a guarantor be a guarantor?","143":"Who is the Architect appointed to the project?","144":"How many notices can be sent to the Employer?","145":"How many notices should be sent to the Employer before Tender?","146":"What are the requirements of the Bill of Quantities?","147":"How many days of delay caused by compensation events?","148":"How many days of delay caused by Compensation Events?","149":"What are the permitted exclusions from insurance of the Works and other Risk Items?","150":"What is the minimum amount of insurance required for the works?","151":"what is a delay cost?","152":"How long does a contractor have to return a certificate of substantial completion?","153":"How long does a contractor have to return a contract?","154":"How long does a contractor have to return to a contract?","155":"Who is required to issue the certificate of Substantial Completion of the Works?","156":"What is a delay cost?","157":"Who is the Employers Representative?","158":"What is the purpose of the contract?","159":"Who is the Managing Director of Build IT Ltd?","160":"What are the requirements for a parent company guarantee?","161":"What are the details for sending other notices to the Contractor under clause 12 or 13?","162":"What are the details for sending other notices to the Contractor?","163":"what is part 1k?","164":"How many days did the Tender Nr 1 Tender Nr 1 Tender Nr 4 Tender Nr 2 have to be delayed?","165":"How long did it take for the excavations to be completed?","166":"How long did it take to complete the excavations?","167":"How many hours did the Archaeology Specialist have to work on the project?","168":"How many hours did the Archaeology Specialist need to work on the project?","169":"How many hours did the Archaeology Specialist have to provide?","170":"what are the relative merits of using the Open or Restricted procedures?","171":"what are the relative merits of using the open or restricted procedures?","172":"Is there a rule for rebalancing items in the BOQ to ensure arithmetic errors are corrected?","173":"What is the difference between a parent company guarantee and a performance bond?","174":"What is the difference between a traditional contract and a DB contract?","175":"What is the difference between a traditional and a DB contract?","176":"What is the definition of 'fit for purpose' in the Road Traffic Act?","177":"What is the purpose of a Bill of Quantities?","178":"What is the purpose of the Bill of Quantities?","179":"What is a non preferred form of procuring Specialists?","180":"What does the definition of unforeseeable mean?","181":"Is there a bonus provision for a loss in a minor works contract?","182":"Does the Contractor have to re-build the Works?","183":"What can be interpreted as referring to two different sums?","184":"What can be interpreted as referring to two different sums in a contract?","185":"What is the purpose of Clause 9?","186":"What is the purpose of the clause 10?","187":"What is the role of a conciliator?","188":"What is the role of the Conciliator?","189":"What is the role of the PSDP in the Works Requirements?","190":"How long does it take to get the contract signed?","191":"How long does it take to get a contract signed?","192":"What is the difference between a contractor and a consultant under the COE?","193":"What is the difference between a contractor and a consultant?"},"expected":{"0":"Enablers for Better Management","1":"Enablers for Better Management","2":"Enablers for Better Management 3","3":"an enabler for good management","4":"MF • Structure of the contract","5":"to challenge the groups to consider","6":"to ensure that there is an integrated methodology","7":"maximising financial certainty by risk allocation","8":"to be used without amendments","9":"to protect public funds","10":"to protect public funds","11":"An understanding of the principles of risk assessment and appropriate risk allocation","12":"An understanding of the principles of risk assessment and appropriate risk allocation","13":"building or civil engineering, traditional or design and build","14":"Contractor’s design","15":"The contracts are written in plain English","16":"The contracts are written in plain English","17":"The contracts are written in plain English","18":"Accepting the Risk and Managing It An existing hospital wing is to be refurbished","19":"Ignore it and deal with it if and when it arises during the construction","20":"Accepting the Risk and Managing It An existing hospital wing is to be refurbished","21":"Unforeseeable utilities","22":"Where \"Yes\" is inserted in a box","23":"compensation event as appropriate","24":"when, having completed a preliminary site investigation in compliance with the NMS Framework","25":"when, having completed a preliminary site investigation in compliance with the NMS Framework","26":"to relocate utilities in advance of the main contract","27":"Works building or civil engineering in nature","28":"the nature of the project, its risks and the programme available","29":"whether to follow the traditional or design and build route Example","30":"whether to follow the traditional or design and build route Example","31":"the programme for a project","32":"Limitations on the Employer's Representative's authority","33":"Limitations on the Employer's Representative's authority","34":"archaeology, ground conditions and utilities","35":"The suitability assessment and procurement of specialists","36":"Tenders are procured on a fixed price lump sum basis","37":"Tenders are procured on a fixed price lump sum basis","38":"Public Works Construction Contracts Training Manual 9 Contract Administration","39":"Issue instructions in writing","40":"Issue instructions in writing","41":"Give a change order where physically impossible or contrary to Legal Requirements to complete Works","42":"activates a Recovery Date","43":"he only recovers the amount in","44":"he only recovers the amount in","45":"ie 10%","46":"mathematically the same","47":"provides for the incorporation into the Contract of post tender clarifications","48":"provides for the incorporation into the Contract","49":"overall design","50":"a minimum period","51":"18 months","52":"over 18 months","53":"rainfall, air temperature and wind speed","54":"to enable him to price the risks being imposed on him","55":"Appendix Consents a. Planning and other consents obtained by the Employer","56":"appointment of project supervisor for construction stage","57":"relevant background information","58":"Training Manual Electrical installation","59":"Training Manual Electrical installation","60":"competent person","61":"The Contractor","62":"professional fees","63":"sub-clause 3.7","64":"sub-clause 3.7","65":"an aggregate sum for each year","66":"minimise delay and Compensation Events and their effects","67":"the Contractor must propose a change to the Works Proposals","68":"the Contractor must propose a change to the Works Proposals","69":"by which such items will be required well in advance","70":"keep all relevant documents on Site including contract documents","71":"keep all relevant documents on Site including contract documents","72":"in advance and about their implementation","73":"give a certificate","74":"comply with","75":"transfer","76":"perform and observe him","77":"perform and observe him","78":"it would obviously be of far greater significance","79":"it would obviously be of far greater significance","80":"monitor, spot check and audit","81":"establish a quality control system","82":"reject the Works or the relevant Section","83":"reject the Works or the relevant Section","84":"reject the Works or the relevant Section","85":"extend the Defects Period","86":"give at least 15 working days notice","87":"by Friday 7 June","88":"by Friday 7 June","89":"Health and Safety","90":"issue a direction to the Contractor to suspend all or part of the Works","91":"issue a direction to the Contractor to suspend all or part of the Works","92":"the ER","93":"how much","94":"how much","95":"20 working days","96":"20 working days","97":"keep in focus","98":"a basis of assessment","99":"Contractor","100":"making of claims by the Employer against the Contractor","101":"20 working days","102":"20 working days","103":"up to a maximum percentage of their value as set out in the Schedule","104":"up to a maximum percentage of their value as set out in the Schedule","105":"The Employer","106":"The Employer","107":"The Employer has no liability for matters not set out in the final statement","108":"Failure by Contractor to comply with contractual obligations","109":"Failure by Contractor to comply with contractual obligations","110":"Failure by Contractor to comply with contractual obligations","111":"clause 12.2","112":"ensure that all Works Items necessary for completion of the Works are kept on Site","113":"ensure that all Works Items necessary for completion of the Works are kept on Site","114":"terminate the Contractor’s obligation to complete the Works for default","115":"terminate the Contractor’s obligation to complete the Works for default","116":"terminate the Contractor’s obligation to complete the Works for default","117":"address this situation","118":"address this situation","119":"disentitle him in respect of his delay and\/or compensation claim","120":"proposed expiry date of the bond","121":"satisfied itself","122":"satisfied itself","123":"satisfied itself","124":"comply with its obligations under the Construction Regulations in connection with that appointment","125":"The Contractor","126":"proceed regularly and diligently","127":"proceed regularly and diligently","128":"by notice to the Employer","129":"for purposes of pre- qualification","130":"Consent","131":"Consent","132":"the Contractor","133":"cost of appointing and fees and expenses","134":"a Change Order","135":"any required Works Item or other thing","136":"any required Works Item or other thing","137":"The Contractor","138":"Contract","139":"all of the following, all executed, as relevant, by the relevant persons","140":"by notice to the Employer","141":"by notice to the Employer","142":"if parent company has been identified for purposes of pre- qualification","143":"The Structural Engineer","144":"12 and 13","145":"12 and 13","146":"the method of measurement according to which it was prepared and measurements","147":"Site Working Days","148":"Site Working Days","149":"terrorism cover","150":"€2,800 per day","151":"single rate","152":"12 months","153":"12 months","154":"12 months","155":"The Employer’s Representative","156":"single rate","157":"Justin Wright Ltd","158":"MEAT","159":"Mr Peter Rock","160":"If none named, no parent company guarantee required","161":"20 The Heights LA Town Co LA","162":"Co LA","163":"Period\/portion of the Works","164":"50 Days","165":"a whole month","166":"a whole month","167":"two","168":"two","169":"20 working days","170":"Guidance Note on the Works Contracts","171":"Guidance Note on the Works Contracts","172":"Variants","173":"not a robust guarantee","174":"It is not necessarily appropriate to automatically seek PI cover from a Contractor","175":"It is not necessarily appropriate to automatically seek PI cover from a Contractor","176":"the willingness of the contracting authority to consider the tender in question","177":"remeasurement of work no longer applies","178":"remeasurement of work no longer applies","179":"Novation","180":"having inspected the site and surroundings","181":"he is not entitled to an adjustment of the Contract Sum","182":"if for instance they are burned down due to no fault of his","183":"paragraph","184":"paragraph","185":"give the appropriate notice","186":"give a certificate","187":"a competent person","188":"a competent person","189":"Temporary Works Designer as a Specialist","190":"6 months","191":"6 months","192":"reasonable skill and care","193":"Contractor has protection of the Contract"},"predicted":{"0":"The purpose of the public works contracts training manual is to improve management.\nThe purpose of this manual is to help better management.\nThere are main topics in the public works construction contracts training manual.\nRelocate utilities is the objective of the enabling works contract.","1":"The purpose of the public works contracts training manual is to improve management.\nThe purpose of this manual is to help better management.\nThere are main topics in the public works construction contracts training manual.\nRelocate utilities is the objective of the enabling works contract.","2":"The purpose of this manual is to help better management.\nThe issue instructions in writing are for employers.\nThe purpose of the public works contracts training manual is to improve management.\nTraining manual electrical installation is the purpose of the construction contract.","3":"Good management can be aided by course purpose.\nThere are main topics in the public works construction contracts training manual.\nThe purpose of the public works contracts training manual is to improve management.\nThe purpose of this manual is to help better management.","4":"There are new forms of contract.\nThere are new forms of contract requirements.\nUnforeseen utilities are included in the new design and build contract.\nThe purpose of the new forms of contract is to increase financial certainty.","5":"The purpose of the exercise is to challenge the groups.\nThe purpose of this manual is to help better management.\nThe purpose of the public works contracts training manual is to improve management.\nRelocate utilities is the objective of the enabling works contract.","6":"The purpose of the capital works management framework is to ensure that there is an integrated methodology.\nBackground information is contained in the public works tender document.\nThe purpose of the public works contracts training manual is to improve management.\nCivil engineering, traditional design and build are some of the public works contract features.","7":"The purpose of the new forms of contract is to increase financial certainty.\nThere are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of new construction contracts is to protect public funds.","8":"There are new forms of contract.\nThere are new forms of contract requirements.\nUnforeseen utilities are included in the new design and build contract.\nThere are new contract requirements for procurement of specialists.","9":"There are new forms of contract.\nThe purpose of new construction contracts is to protect public funds.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.","10":"The purpose of new construction contracts is to protect public funds.\nThere are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.\nThere are new contract requirements for procurement of specialists.\nUnforeseen utilities are included in the new design and build contract.","11":"There are new forms of contract.\nThere are new forms of contract requirements.\nThere are new contract requirements for procurement of specialists.\nThe purpose of the new forms of contract is to increase financial certainty.","12":"The new forms difference is an understanding of the principles of risk assessment.\nThere are new forms of contract.\nThere are new forms of contract requirements.\nWhat is the difference between a traditional contract and a public works contract?","13":"Civil engineering, traditional design and build are some of the public works contract features.\nThe employer is a contractor.\nWhat is the difference between a traditional contract and a public works contract?\nThere are main topics in the public works construction contracts training manual.","14":"CONTRACT FEATURE is the design of the contract.\nMf is the structure of the contract.\nThe contractor is the company that gives the job to the employee.\nContractual obligation is the job of the employer.","15":"There are new forms of contract.\nThe new contracts impact is the topic of the introduction.\nThere is an understanding of the principles of risk assessment in new contracts.\nRecovery date is the contract purpose.","16":"There are new forms of contract.\nThe new contracts impact is the topic of the introduction.\nThere is an understanding of the principles of risk assessment in new contracts.\nThe contracts are written in plain English.","17":"There are new forms of contract.\nThe new contracts impact is the topic of the introduction.\nThere is an understanding of the principles of risk assessment in new contracts.\nRecovery date is the contract purpose.","18":"Accepting the risk and managing contaminated soil is what stewardship is all about.\nIf the site becomes contaminated during the construction, ignore it and deal with it.\nArchaeological risk is the contracting authority's risk.\nThe Contractor is responsible for the damage after the work has been completed.","19":"Accepting the risk and managing contaminated soil is what stewardship is all about.\nIf the site becomes contaminated during the construction, ignore it and deal with it.\nThe preliminary site investigation complaint is a framework.\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.","20":"Accepting the risk and managing contaminated soil is what stewardship is all about.\nIf the site becomes contaminated during the construction, ignore it and deal with it.\nThe preliminary site investigation complaint is a framework.\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.","21":"The purpose of new construction contracts is to protect public funds.\nThe employer is a contractor.\nUnforeseen utilities are included in the new design and build contract.\nWhat is the difference between a design and construct contract and a design and construct contract?","22":"Delay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nDelay compensation events are on site working days.\nMinimise Delay And Compensation Events And Their Effects is what a co insured contractor does.","23":"Delay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nDelay cost deflation is a single rate.\nMinimise Delay And Compensation Events And Their Effects is what a co insured contractor does.","24":"The contracting authority risks allOCATION is a contractor.\nArchaeological risk is the contracting authority's risk.\nThe employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?","25":"The contracting authority risks allOCATION is a contractor.\nArchaeological risk is the contracting authority's risk.\nThe employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?","26":"Relocate utilities is the objective of the enabling works contract.\nThe Enabling Works Contract is the main contract.\nThe employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?","27":"There are main topics in the public works construction contracts training manual.\nCivil engineering, traditional design and build are some of the public works contract features.\nThe purpose of the public works contracts training manual is to improve management.\nThe employer is a contractor.","28":"There are risks to the procurement strategy.\nThe project is called Procurement Strategy Influence.\nThe programme is called the procurement strategy influENCE.\nThere are new contract requirements for procurement of specialists.","29":"There are new forms of contract.\nThere are new forms of contract requirements.\nThere are conditions of contract for employers representative.\nContractual obligation is the job of the employer.","30":"There are new forms of contract.\nThere are conditions of contract for employers representative.\nThere are new forms of contract requirements.\nContractual obligation is the job of the employer.","31":"There are new forms of contract.\nThere are new forms of contract requirements.\nThere are conditions of contract for employers representative.\nDesign and build route is a form of contract.","32":"There are main topics in the public works construction contracts training manual.\nPricing risks are included in the Public Works Construction Contracts Training Manual.\nCivil engineering, traditional design and build are some of the public works contract features.\nThe employer is a contractor.","33":"There are main topics in the public works construction contracts training manual.\nPricing risks are included in the Public Works Construction Contracts Training Manual.\nCivil engineering, traditional design and build are some of the public works contract features.\nThe employer is a contractor.","34":"There are risks to the procurement strategy.\nThe issue instructions in writing are for employers.\nThere are main topics in the public works construction contracts training manual.\nLimitations on the employer's representative's authority is an issue intersectionality.","35":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe new contracts impact is the topic of the introduction.\nUnforeseen utilities are included in the new design and build contract.","36":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe new contracts impact is the topic of the introduction.\nThere are new contract requirements for procurement of specialists.","37":"There are new forms of contract.\nThe new contracts impact is the topic of the introduction.\nThere are new forms of contract requirements.\nThere are new contract requirements for procurement of specialists.","38":"The programme is called the procurement strategy influENCE.\nThere are risks to the procurement strategy.\nA basis of assessment is the purpose of the pricing document.\nThe purpose of the new forms of contract is to increase financial certainty.","39":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nThe employer is a contractor.\nWhat do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?","40":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nThe employer is a contractor.\nWhat do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?","41":"What can be done to make sure the contractor is ready for the work?\nSubstantial Completion is a change order.\nContractor return time is a certificate of completion.\nThe Contractor is responsible for the damage after the work has been completed.","42":"Contractual obligation is the job of the employer.\nThe contractor is the company that gives the job to the employee.\nMeat is the contract purpose.\nRecovery date is the contract purpose.","43":"The formula fluectuations method works.\nFormula Fluctuations method of operation works.\nThe operation of hyperinflation is working.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.","44":"The formula fluectuations method works.\nFormula Fluctuations method of operation works.\nThe operation of hyperinflation is working.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.","45":"Interim certificate is for Wyzp RECOVERY PERCENTAGE.\nThe maximum percentage is the employer calculation rule.\nThe minimum insurance amount is 2,800 per day.\nThere is an employer deferral right.","46":"The operation of hyperinflation is working.\nThe formula fluectuations method works.\nFormula Fluctuations method of operation works.\nThe maximum percentage is the employer calculation rule.","47":"Post tender clarifications are what the letter of acceptance is for.\nThe Parent Company is the guarantor.\nThe willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nAppendix consents are required for the public works contract.","48":"Post tender clarifications are what the letter of acceptance is for.\nBackground information is contained in the public works tender document.\nThe willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nContractor return time is a certificate of completion.","49":"Contractual obligation is the job of the employer.\nThe contractor is the company that gives the job to the employee.\nMeat is the contract purpose.\nRecovery date is the contract purpose.","50":"The employer's response time is 20 working days.\n20 working days is the working hours of an archaeology specialist.\nContractor return time is a certificate of completion.\nGive at least 15 working days notice.","51":"The employer's response time is 20 working days.\nWhat can be done to make sure the contractor is ready for the work?\n20 working days is the working hours of an archaeology specialist.\nThe Contractor is responsible for the damage after the work has been completed.","52":"The employer's response time is 20 working days.\nExtending the defects period is an action to take.\n20 working days is the working hours of an archaeology specialist.\nThe Contractor is responsible for the damage after the work has been completed.","53":"There is a minimum insurance limit in the schedule.\nDelay or compensation event critique is a possibility.\nDelay relationship is a compensation event.\nThe days of deferral are site working days.","54":"The purpose of the public works contracts training manual is to improve management.\nThere are main topics in the public works construction contracts training manual.\nThe employer is a contractor.\nPricing risks are included in the Public Works Construction Contracts Training Manual.","55":"Civil engineering, traditional design and build are some of the public works contract features.\nAppendix consents are required for the public works contract.\nThe employer is a contractor.\nWhat is the difference between a traditional contract and a public works contract?","56":"What does a Novation of a contract mean?\nThe project supervisor is Novation And Guarantee Deed.\nNovation is a non preferred form of Procuring Specialists.\nContractor return time is a contract.","57":"Background information is contained in the public works tender document.\nCivil engineering, traditional design and build are some of the public works contract features.\nAppendix consents are required for the public works contract.\nThere are main topics in the public works construction contracts training manual.","58":"The purpose of new construction contracts is to protect public funds.\nThe contractor is the company that gives the job to the employee.\nTraining manual electrical installation is the purpose of the construction contract.\nContractual obligation is the job of the employer.","59":"The purpose of new construction contracts is to protect public funds.\nTraining manual electrical installation is the purpose of the construction contract.\nThe employer is a contractor.\nCivil engineering, traditional design and build are some of the public works contract features.","60":"Competent person is what the definition of a contractor's personnel is.\nThe employer is a contractor.\nThe contractor is the company that gives the job to the employee.\nThe Contractor is the one who executed all of the following.","61":"The Contractor is responsible for the damage after the work has been completed.\nSubstantial Completion is a change order.\nThere is an employer compliance requirement.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.","62":"What is the difference between a traditional contract and a public works contract?\nWhat is the difference between a design and construction contract and a public works contract?\nThe employer is a contractor.\nCivil engineering, traditional design and build are some of the public works contract features.","63":"There is a minimum insurance limit in the schedule.\nThe minimum insurance amount is 2,800 per day.\nThe minimum insurance limit is known as SubClause 3.7.\nWhat is the difference between professional and personal insurance?","64":"There is a minimum insurance limit in the schedule.\nThe minimum insurance amount is 2,800 per day.\nThe minimum insurance limit is known as SubClause 3.7.\nExclusions are allowed for terrorism cover.","65":"What is the difference between professional and personal insurance?\nThere is a minimum insurance limit in the schedule.\nWhat is the difference between a traditional contract and a public works contract?\nThe minimum insurance limit is known as SubClause 3.7.","66":"Minimise Delay And Compensation Events And Their Effects is what a co insured contractor does.\nThe employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nThe Contractor is responsible for the damage after the work has been completed.","67":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nWhat can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.\nEstablish a quality control system is the responsibility of the contractor.","68":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nWhat can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.\nThe responsibilities of the contractor are monitor, spot check and audit.\nContractor compensation is the job of the contractor.\nEstablish a quality control system is the responsibility of the contractor.","69":"What can be done to make sure that the contractor is aware of all relevant dates?\nWhat do the contractors have to do to keep the Er informed?\nWhat can be done to make sure the contractor is ready for the work?\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.","70":"What can be done to make sure the contractor is ready for the work?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.\nWhat do the contractors have to do to keep the Er informed?\nThe employer is a contractor.","71":"What can be done to make sure the contractor is ready for the work?\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nWhat do the contractors have to do to keep the Er informed?","72":"What do the contractors have to do to keep the Er informed?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.\nThe employer is a contractor.","73":"What do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?\nThe rates of pay and conditions of employment have to be complied with.\nThe employer is a contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nContractor compensation is the job of the contractor.\nWhat do the contractors have to do to keep the Er informed?","74":"What do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?\nThe rates of pay and conditions of employment have to be complied with.\nThe employer is a contractor.\nContractor compensation is the job of the contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nWhat do the contractors have to do to keep the Er informed?","75":"What does a Novation of a contract mean?\nThere are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.","76":"If he wants to remove the specialist from the site, what should he do?\nWhat do the contractors have to do to keep the Er informed?\nThere are new contract requirements for procurement of specialists.\nThe action to take is to issue a direction to the contractor to stop the work.","77":"If he wants to remove the specialist from the site, what should he do?\nWhat do the contractors have to do to keep the Er informed?\nThe action to take is to issue a direction to the contractor to stop the work.\nThere are new contract requirements for procurement of specialists.","78":"What is the difference between a design and construct contract and a design and construct contract?\nDesign and build route is a form of contract.\nWhat is the difference between a design and construction contract and a public works contract?\nThe employer is a contractor.","79":"What is the difference between a design and construct contract and a design and construct contract?\nWhat is the difference between a design and construction contract and a public works contract?\nThe employer is a contractor.\nWhat is the difference between a traditional contract and a public works contract?","80":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe responsibilities of the contractor are monitor, spot check and audit.\nThe employer is a contractor.","81":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nEstablish a quality control system is the responsibility of the contractor.\nThe Contractor enters a contract that is satisfactory.\nThe responsibilities of the contractor are monitor, spot check and audit.\nThe employer is a contractor.","82":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nThe action to take is to issue a direction to the contractor to stop the work.\nIf he wants to remove the specialist from the site, what should he do?","83":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nRejecting the works or the relevant section is the action to take.\nThe action to take is to issue a direction to the contractor to stop the work.","84":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nIf he wants to remove the specialist from the site, what should he do?\nThe action to take is to issue a direction to the contractor to stop the work.","85":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nThe action to take is to issue a direction to the contractor to stop the work.\nWhat can be done to make sure that the contractor is aware of all relevant dates?","86":"What do the contractors have to do to keep the Er informed?\nThe action to take is to issue a direction to the contractor to stop the work.\nRejecting the works or the relevant section is the action to take.\nWhat can be done to make sure that the contractor is aware of all relevant dates?","87":"Give at least 15 working days notice.\nThe employer is a contractor.\nThe contractor must give notice to the employer.\nContractor return time is a contract.","88":"Give at least 15 working days notice.\nThe employer is a contractor.\nThe contractor must give notice to the employer.\nNotices are sent to the employer before the job is done.","89":"There is an employer compliance requirement.\nThe issue instructions in writing are for employers.\nContractual obligation is the job of the employer.\nConditions of contract clause is for employers representative","90":"The action to take is to issue a direction to the contractor to stop the work.\nRejecting the works or the relevant section is the action to take.\nIf he wants to remove the specialist from the site, what should he do?\nWhat do the contractors have to do to keep the Er informed?","91":"The action to take is to issue a direction to the contractor to stop the work.\nRejecting the works or the relevant section is the action to take.\nIf he wants to remove the specialist from the site, what should he do?\nWhat do the contractors have to do to keep the Er informed?","92":"Conditions of contract clause is for employers representative\nExtending the defects period is an action to take.\nClause 12.2 is the employer's compliance.\nSubClause 5 is the employer liability exclusion.","93":"The purpose of the new forms of contract is to increase financial certainty.\nThere is an employer deferral right.\nThe purpose of the capital works management framework is to ensure that there is an integrated methodology.\nThe days of deferral are site working days.","94":"The purpose of the new forms of contract is to increase financial certainty.\nThere is an employer deferral right.\nThe purpose of the capital works management framework is to ensure that there is an integrated methodology.\nThe days of deferral are site working days.","95":"The employer's response time is 20 working days.\nGive at least 15 working days notice.\n50 days is the duration of the tender.\nWhat do the contractors have to do to keep the Er informed?","96":"The employer's response time is 20 working days.\nGive at least 15 working days notice.\n50 days is the duration of the tender.\nWhat do the contractors have to do to keep the Er informed?","97":"What do the contractors have to do to keep the Er informed?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nDelay or compensation event critique is a possibility.\nGive at least 15 working days notice.","98":"A basis of assessment is the purpose of the pricing document.\nBackground information is contained in the public works tender document.\nThere is a fixed price for the new contracts challenge.\nThe parent company is the contractor.","99":"Delay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nDelay compensation events are on site working days.\nThe Contractor is responsible for the damage after the work has been completed.","100":"Relocate utilities is the objective of the enabling works contract.\nThe purpose of this manual is to help better management.\nThe minimum insurance limit is known as SubClause 3.7.\nA basis of assessment is the purpose of the pricing document.","101":"The employer's response time is 20 working days.\nGive at least 15 working days notice.\n50 days is the duration of the tender.\nWhat do the contractors have to do to keep the Er informed?","102":"Give at least 15 working days notice.\n50 days is the duration of the tender.\nWhat do the contractors have to do to keep the Er informed?\nThe issue instructions in writing are for employers.","103":"What do the contractors have to do to keep the Er informed?\nThere is a bill of quantities requirements.\nExtending the defects period is an action to take.\nHealth and safety are considered.","104":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nHealth and safety are considered.\nThe rates of pay and conditions of employment have to be complied with.","105":"There is an employer deferral right.\nThe notices are for the employer.\nThe rates of pay and conditions of employment have to be complied with.\nThe employer is a contractor.","106":"There is an employer deferral right.\nThe notices are for the employer.\nThe cost of consent is the contractor.\nThe employer is a contractor.","107":"SubClause 5 is the employer liability exclusion.\nThe purpose of this manual is to help better management.\nA basis of assessment is the purpose of the pricing document.\nThe purpose of the capital works management framework is to ensure that there is an integrated methodology.","108":"Termination action is taken by an employer.\nContractual obligation is the job of the employer.\nThere are conditions of contract for employers representative.\nThe employer is a contractor.","109":"Termination action is taken by an employer.\nContractual obligation is the job of the employer.\nThere are conditions of contract for employers representative.\nThe employer is a contractor.","110":"Termination action is taken by an employer.\nThere are conditions of contract for employers representative.\nThe employer is a contractor.\nComplying With Contractual Obligations is a failure by the contractor.","111":"Termination action is taken by an employer.\nThe notices are for the employer.\nThere are conditions of contract for employers representative.\nComplying With Contractual Obligations is a failure by the contractor.","112":"The issue instructions in writing are for employers.\nContractual obligation is the job of the employer.\nWhat can be done to make sure the contractor is ready for the work?\nThere is an employer compliance requirement.","113":"Termination action is taken by an employer.\nThe issue instructions in writing are for employers.\nContractual obligation is the job of the employer.\nThere is an employer deferral right.","114":"Termination action is taken by an employer.\nThere is an employer deferral right.\nContractual obligation is the job of the employer.\nContractor TermiNATE OBLIGATION is an employer.","115":"Termination action is taken by an employer.\nContractor TermiNATE OBLIGATION is an employer.\nContractual obligation is the job of the employer.\nThere is an employer deferral right.","116":"Termination action is taken by an employer.\nContractor TermiNATE OBLIGATION is an employer.\nContractual obligation is the job of the employer.\nThere is an employer deferral right.","117":"Termination action is taken by an employer.\nThere is an employer deferral right.\nContractual obligation is the job of the employer.\nContractor TermiNATE OBLIGATION is an employer.","118":"Termination action is taken by an employer.\nContractual obligation is the job of the employer.\nContractor TermiNATE OBLIGATION is an employer.\nThere is an employer deferral right.","119":"There are notice provisions for employer noncompliance.\nThe contractor must give notice to the employer.\nThe rates of pay and conditions of employment have to be complied with.\nGive at least 15 working days notice.","120":"The employer is a contractor.\nContractor compensation is the job of the contractor.\nContractor return time is a contract.\nThe cost of consent is the contractor.","121":"What can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nNotices are sent to the employer before the job is done.","122":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe employer is a contractor.\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.","123":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe employer is a contractor.\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.","124":"The employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nContractor TermiNATE OBLIGATION is an employer.\nThe contractor is the company that gives the job to the employee.","125":"The Contractor is the one who executed all of the following.\nWhat can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe Contractor is responsible for the damage after the work has been completed.","126":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe employer is a contractor.\nThe Contractor is the one who executed all of the following.\nThe responsibilities of the contractor are monitor, spot check and audit.","127":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe responsibilities of the contractor are monitor, spot check and audit.\nThe employer is a contractor.\nThe Contractor is the one who executed all of the following.","128":"The employer is a contractor.\nThe action to take is to issue a direction to the contractor to stop the work.\nWhat can be done to make sure the contractor is ready for the work?\nContractor TermiNATE OBLIGATION is an employer.","129":"The Parent Company is the guarantor.\nThere is no Parent Company Guarantee requirement.\nIt is not a robust guarantee.\nThe project supervisor is Novation And Guarantee Deed.","130":"What can be done to make sure the contractor is ready for the work?\nCivil engineering, traditional design and build are some of the public works contract features.\nThe Contractor is responsible for the damage after the work has been completed.\nWhat is the difference between a design and construction contract and a public works contract?","131":"Civil engineering, traditional design and build are some of the public works contract features.\nThe Contractor is responsible for the damage after the work has been completed.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nWhat is the difference between a design and construction contract and a public works contract?","132":"The project supervisor is Novation And Guarantee Deed.\nStructural Engineer was appointed to the project.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nCompetent person is what the definition of a contractor's personnel is.","133":"The project supervisor is Novation And Guarantee Deed.\nThe employer is a contractor.\nThe contractor's cost is the cost of appointing and fees and expenses.\nThe cost of consent is the contractor.","134":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nContractual obligation is the job of the employer.\nThe employer is a contractor.","135":"The contractor is the thing that has to be submitted to the employer.\nThere are conditions of contract for employers representative.\nThe employer is a contractor.\nThe issue instructions in writing are for employers.\nConditions of contract clause is for employers representative\nWhat do the contractors have to do to keep the Er informed?\nThe contractor must give notice to the employer.","136":"The contractor is the thing that has to be submitted to the employer.\nThere are conditions of contract for employers representative.\nThe employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nConditions of contract clause is for employers representative\nThe contractor must give notice to the employer.\nThe issue instructions in writing are for employers.","137":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe Contractor is responsible for the damage after the work has been completed.\nThe notices are for the employer.","138":"The contractor must give notice to the employer.\nThe contractor is the thing that has to be submitted to the employer.\nThe employer is a contractor.\nNotices are sent to the employer before the job is done.","139":"The contractor must give notice to the employer.\nThe contractor is the thing that has to be submitted to the employer.\nThe employer is a contractor.\nNotices are sent to the employer before the job is done.","140":"Termination action is taken by an employer.\nContractor TermiNATE OBLIGATION is an employer.\nThe employer is a contractor.\nContractual obligation is the job of the employer.\nThe action to take is to issue a direction to the contractor to stop the work.\nThere is an employer deferral right.","141":"The employer is a contractor.\nContractor TermiNATE OBLIGATION is an employer.\nThe action to take is to issue a direction to the contractor to stop the work.\nContractor compensation is the job of the contractor.","142":"The Parent Company is the guarantor.\nIt is not a robust guarantee.\nThere is no Parent Company Guarantee requirement.\nThe project supervisor is Novation And Guarantee Deed.","143":"Unforeseen utilities are included in the new design and build contract.\nStructural Engineer was appointed to the project.\nCONTRACT FEATURE is the design of the contract.\nComplying with its obligations under the construction regulations is what datememe is for.","144":"The notices are for the employer.\nThere are notice provisions for employer noncompliance.\nThe issue instructions in writing are for employers.\nGive at least 15 working days notice.","145":"Notices are sent to the employer before the job is done.\nThere are notice provisions for employer noncompliance.\nThe notices are for the employer.\nThe issue instructions in writing are for employers.","146":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nThere are conditions of contract for employers representative.\nThe Contractor must propose a change to the works proposals.","147":"Delay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nDelay compensation events are on site working days.\nThe days of deferral are site working days.","148":"Delay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nDelay compensation events are on site working days.\nThe days of deferral are site working days.","149":"Exclusions are allowed for terrorism cover.\nThere is an employer compliance requirement.\nRejecting the works or the relevant section is the action to take.\nThe change order compliance requirements are works.","150":"The minimum insurance amount is 2,800 per day.\nThe minimum insurance limit is known as SubClause 3.7.\nThe contractor is the thing that has to be submitted to the employer.\nThe Contractor is responsible for the damage after the work has been completed.","151":"Delay cost deflation is a single rate.\nDelay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nMinimise Delay And Compensation Events And Their Effects is what a co insured contractor does.","152":"Contractor return time is a certificate of completion.\nContractor return time is a contract.\nThe Contractor enters a contract that is satisfactory.\nThe employer is a contractor.","153":"Contractor return time is a contract.\nThe employer is a contractor.\nThe Contractor enters a contract that is satisfactory.\nContractor return time is a certificate of completion.","154":"Contractor return time is a contract.\nThe employer is a contractor.\nContractor compensation is the job of the contractor.\nThe Contractor enters a contract that is satisfactory.","155":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nContractor return time is a certificate of completion.\nThe Contractor is responsible for the damage after the work has been completed.\nSubstantial Completion is a change order.","156":"Delay cost deflation is a single rate.\nDelay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nMinimise Delay And Compensation Events And Their Effects is what a co insured contractor does.","157":"The Employers Representative is Justin Wright.\nContractual obligation is the job of the employer.\nThe issue instructions in writing are for employers.\nThe notices are for the employer.","158":"Contractual obligation is the job of the employer.\nThe contractor is the company that gives the job to the employee.\nMeat is the contract purpose.\nRecovery date is the contract purpose.","159":"The employer is a contractor.\nMr Peter Rock is the Managing Director of Identity.\nThe project supervisor is Novation And Guarantee Deed.\nNotices are sent to the employer before the job is done.","160":"The Parent Company is the guarantor.\nThere is no Parent Company Guarantee requirement.\nIt is not a robust guarantee.","161":"The employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nThe contractor must give notice to the employer.","162":"The employer is a contractor.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nWhat do the contractors have to do to keep the Er informed?\nThe contractor is the thing that has to be submitted to the employer.","163":"Part 1K is a portion of the works.\nThe preliminary site investigation complaint is a framework.\nThe action to take is to issue a direction to the contractor to stop the work.\nHealth and safety are considered.","164":"50 days is the duration of the tender.\nThe employer's response time is 20 working days.\nComplying with its obligations under the construction regulations is what datememe is for.\nThe willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.","165":"20 working days is the working hours of an archaeology specialist.\nExcavations are a whole month.\nContractor return time is a certificate of completion.\nAn archaeology specialist works two hours a day.","166":"20 working days is the working hours of an archaeology specialist.\nExcavations are a whole month.\nAn archaeology specialist works two hours a day.\nContractor return time is a certificate of completion.","167":"20 working days is the working hours of an archaeology specialist.\nAn archaeology specialist works two hours a day.\n50 days is the duration of the tender.\nThe days of deferral are site working days.","168":"20 working days is the working hours of an archaeology specialist.\nAn archaeology specialist works two hours a day.\n50 days is the duration of the tender.\nThe days of deferral are site working days.","169":"20 working days is the working hours of an archaeology specialist.\nAn archaeology specialist works two hours a day.\nIf he wants to remove the specialist from the site, what should he do?\nExcavations are a whole month.","170":"Guidance note on the works contracts is open or restricted procedures.\nThere are risks to the procurement strategy.\nThere are new contract requirements for procurement of specialists.\nWhat can be done to make sure the contractor is ready for the work?","171":"Guidance note on the works contracts is open or restricted procedures.\nThere are risks to the procurement strategy.\nWhat can be done to make sure the contractor is ready for the work?\nNovation is a non preferred form of Procuring Specialists.","172":"There are variations in the Boq CORRECTION RULE.\nThere is a bill of quantities requirements.\nIt is not a robust guarantee.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.","173":"The Parent Company is the guarantor.\nWhat is the difference between professional and personal insurance?\nIt is not a robust guarantee.\nThere is no Parent Company Guarantee requirement.","174":"What is the difference between a traditional contract and a public works contract?\nThe traditional route is the form of contract company.\nThe employer is a contractor.\nDesign and build route is a form of contract.","175":"The traditional route is the form of contract company.\nWhat is the difference between a traditional contract and a public works contract?\nDesign and build route is a form of contract.\nWhat is the difference between a design and construction contract and a public works contract?","176":"The willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nCompetent person is what the definition of a contractor's personnel is.\nThere are new forms of contract requirements.\nThe parent company is the contractor.","177":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nBackground information is contained in the public works tender document.\nUnforeseen utilities are included in the new design and build contract.","178":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nBackground information is contained in the public works tender document.\nThe parent company is the contractor.","179":"Novation is a non preferred form of Procuring Specialists.\nThere are new contract requirements for procurement of specialists.\nThere are risks to the procurement strategy.\nThe programme is called the procurement strategy influENCE.","180":"Unforeseen utilities are included in the new design and build contract.\nDelay relationship is a compensation event.\nRemeasurement of work no longer applies to the bill of quantities function.\nThe days of deferral are site working days.","181":"Conditions of contract clause is for employers representative\nDelay relationship is a compensation event.\nGuidance note on the works contracts is open or restricted procedures.\nAppendix consents are required for the public works contract.","182":"The Contractor must propose a change to the works proposals.\nThe employer is a contractor.\nThe Contractor is responsible for the damage after the work has been completed.\nContractor compensation is the job of the contractor.","183":"Part 1K is a portion of the works.\nThe new forms difference is an understanding of the principles of risk assessment.\nWhat is the difference between a traditional contract and a public works contract?\nThere is an employer deferral right.","184":"Mf is the structure of the contract.\nThere are new forms of contract.\nThere are conditions of contract for employers representative.\nContractor return time is a contract.","185":"Conditions of contract clause is for employers representative\nLimitations on the employer's representative's authority is an issue intersectionality.\nClause 12.2 is the employer's compliance.\nArchaeological risk is the contracting authority's risk.","186":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nLimitations on the employer's representative's authority is an issue intersectionality.\nClause 12.2 is the employer's compliance.","187":"Conditions of contract clause is for employers representative\nThere are conditions of contract for employers representative.\nNotices are sent to the employer before the job is done.\nThe notices are for the employer.","188":"The issue instructions in writing are for employers.\nConditions of contract clause is for employers representative\nThere are conditions of contract for employers representative.\nThe Employers Representative is Justin Wright.","189":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nRelocate utilities is the objective of the enabling works contract.\nThe parent company is the contractor.\nThe purpose of the public works contracts training manual is to improve management.","190":"Contractor return time is a contract.\nContractual obligation is the job of the employer.\nRecovery date is the contract purpose.\nThe contractor is the company that gives the job to the employee.","191":"Contractor return time is a contract.\nContractual obligation is the job of the employer.\nThe contractor is the company that gives the job to the employee.\nRecovery date is the contract purpose.","192":"The contractor is the company that gives the job to the employee.\nThe Contractor is the one who executed all of the following.\nThe contractor is the thing that has to be submitted to the employer.\nThe employer is a contractor.","193":"The contractor is the company that gives the job to the employee.\nThe contractor is the thing that has to be submitted to the employer.\nThe Contractor is the one who executed all of the following.\nThe employer is a contractor."},"llama_eval":{"0":"Yes","1":"Yes","2":"Yes","3":"Yes","4":"Yes","5":"Yes","6":"Yes","7":"Yes","8":"Yes","9":"Yes","10":"Yes","11":"Yes","12":"Yes","13":"Yes","14":"Yes","15":"Yes","16":"Yes","17":"Yes","18":"Yes","19":"Yes","20":"Yes","21":"Yes","22":"Yes","23":"Yes","24":"No","25":"No","26":"Yes","27":"Yes","28":"Yes","29":"Yes","30":"Yes","31":"Yes","32":"No","33":"No","34":"No","35":"Yes","36":"Yes","37":"Yes","38":"Yes","39":"No","40":"No","41":"Yes","42":"Yes","43":"Yes","44":"Yes","45":"Yes","46":"Yes","47":"Yes","48":"Yes","49":"Yes","50":"Yes","51":"No","52":"No","53":"Yes","54":"Yes","55":"Yes","56":"Yes","57":"Yes","58":"Yes","59":"Yes","60":"Yes","61":"Yes","62":"Yes","63":"Yes","64":"Yes","65":"No","66":"Yes","67":"Yes","68":"Yes","69":"Yes","70":"Yes","71":"Yes","72":"Yes","73":"Yes","74":"Yes","75":"Yes","76":"Yes","77":"Yes","78":"Yes","79":"Yes","80":"Yes","81":"Yes","82":"No","83":"Yes","84":"Yes","85":"Yes","86":"Yes","87":"Yes","88":"Yes","89":"Yes","90":"Yes","91":"Yes","92":"Yes","93":"Yes","94":"Yes","95":"Yes","96":"Yes","97":"Yes","98":"Yes","99":"Yes","100":"Yes","101":"Yes","102":"Yes","103":"No","104":"No","105":"Yes","106":"Yes","107":"Yes","108":"Yes","109":"Yes","110":"Yes","111":"Yes","112":"Yes","113":"Yes","114":"Yes","115":"Yes","116":"Yes","117":"Yes","118":"Yes","119":"Yes","120":"Yes","121":"Yes","122":"Yes","123":"Yes","124":"No","125":"Yes","126":"Yes","127":"Yes","128":"No","129":"Yes","130":"No","131":"No","132":"Yes","133":"Yes","134":"Yes","135":"Yes","136":"Yes","137":"Yes","138":"Yes","139":"Yes","140":"Yes","141":"Yes","142":"Yes","143":"Yes","144":"Yes","145":"Yes","146":"Yes","147":"Yes","148":"Yes","149":"Yes","150":"Yes","151":"Yes","152":"Yes","153":"Yes","154":"Yes","155":"Yes","156":"Yes","157":"Yes","158":"Yes","159":"Yes","160":"Yes","161":"Yes","162":"Yes","163":"Yes","164":"Yes","165":"Yes","166":"Yes","167":"Yes","168":"Yes","169":"No","170":"Yes","171":"Yes","172":"Yes","173":"Yes","174":"No","175":"No","176":"Yes","177":"Yes","178":"Yes","179":"Yes","180":"Yes","181":"Yes","182":"Yes","183":"Yes","184":"Yes","185":"Yes","186":"Yes","187":"Yes","188":"Yes","189":"Yes","190":"Yes","191":"Yes","192":"Yes","193":"Yes"},"pertub_query":{"0":"What is the primary objective of the Public Works Contracts Training Manual?","1":"What is the primary objective or function of the Public Works Contracts training manual?","2":"What is the intended function or objective of this guide?","3":"What is the objective or goal of the course?","4":"What characterizes the contemporary varieties of agreement?","5":"What is the objective or intention behind this physical activity?","6":"What is the fundamental objective or intention behind the Capital Works Management Framework?","7":"What is the objective or intention behind the creation of these revised agreements?","8":"What modern alternatives to traditional construction contract types exist today?","9":"What is the intended objective behind the development of updated contract formats specifically designed for public infrastructure projects?","10":"What do the newly established types of building contracts aim to achieve?","11":"What distinctive features distinguish the newly introduced agreements from the formerly employed contract terms in their respective industries?","12":"What distinguishes the revised forms from their predecessors?","13":"What key aspects do a typical public works contract typically encompass?","14":"What constitutes the essential elements or terms that comprise an agreement?","15":"What are the principal differences between the current agreements and their predecessors?","16":"What distinct modifications were introduced in the new agreements compared to their predecessors?","17":"What provisions have been modified or updated in the revised agreement compared to the original contract?","18":"How might contamination of soil be mitigated?","19":"How can a polluted location be safely and effectively managed?","20":"How can you effectively handle polluted earth?","21":"What exactly does the revised design-and-build agreement entail?","22":"Can you provide more context or clarify what you mean by \"delay\" or \"compensation event\", as I'd like to offer an alternative phrasing that accurately captures your intended inquiry?","23":"What is the concept or term commonly used to describe a period of time during which something expected to happen has been postponed or put off?","24":"What methodology should a contracting party employ to assign the level of risk associated with archaeological discoveries to the contractor in their agreement?","25":"What methodology or framework should a contracting authority utilize in assessing and allocating the associated risks of discovery of archaeological sites to a subcontractor?","26":"What is the primary intention behind entering into an enabling works contract?","27":"What subjects or areas of focus does the Public Works Construction Contracts Training Manual primarily cover?","28":"What are the key elements that should be taken into account when determining an effective approach for purchasing goods or services?","29":"What key factors should be weighed when selecting a suitable contractual arrangement?","30":"What factors should be taken into account when selecting the most suitable type of agreement?","31":"What factors should be taken into account when selecting the most suitable type of agreement?","32":"How might key challenges and considerations be incorporated into the Public Works Construction Contracts Training Manual?","33":"What key topics or areas of concern should be included in the Public Works Construction Contracts training program's instructional content?","34":"What key concerns should we prioritize addressing?","35":"What distinctions can be identified between the current contract types and their updated counterparts?","36":"What challenges and difficulties do you anticipate arising from implementing the newly introduced contracts?","37":"What significant challenges do newly introduced contracts typically pose for organizations and stakeholders alike?","38":"What is the primary function and scope of the Department of Finance's National Public Procurement Policy Unit?","39":"Who is responsible for fulfilling their obligations as specified in the Employers' Representative section within the Conditions of Contract?","40":"What are the specific responsibilities entrusted to the Employer's designated representative within the framework of the employment contract?","41":"After reaching substantial completion, what is your next step?","42":"What is the objective of the agreement?","43":"What is the underlying mechanism behind the PV2 formula?","44":"What is the underlying mechanism behind the Formula Fluctuations Method?","45":"What proportion of the WYZP assets is expected to be settled through an interim payment?","46":"What is the underlying mechanism behind the Hyperinflation Formula?","47":"What is the function or intended use of an acceptance letter?","48":"What provisions regarding post-tender clarifications are outlined in the Letter of Acceptance?","49":"What is the main objective or intent behind drafting the agreement?","50":"What is the expected timeframe for finishing a section of work or project?","51":"What is typically required in terms of time and effort to complete a snagging inspection or rectification project?","52":"What is the estimated timeframe required for completing the snagging process?","53":"What does the term \"weather event\" mean according to the Schedule?","54":"What is the intended function or objective of a manual specifically designed to provide training and guidance on public works construction contracts?","55":"What are the essential specifications and criteria necessary for securing a municipal or infrastructure project contract?","56":"What is the significance of a novation and guarantee deed in the context of property transactions?","57":"What essential details should be presented in the Public Works Tender Document?","58":"What is the primary function or intended outcome of entering into a construction agreement?","59":"What is the primary goal or objective of entering into a construction contract?","60":"Who constitutes the personnel of a contractor?","61":"To whom does liability fall for harm caused to the project site once a predetermined threshold of completion has been reached?","62":"What distinct characteristics set apart a standard agreement from a government-funded project pact?","63":"What is the lowest amount that can be claimed under a Public Liability insurance policy?","64":"What is the lowest amount of financial compensation specified in the schedule?","65":"What are the key distinctions between a liability insurance policy and a personal guarantee?","66":"What is the role of a co-insured contractor?","67":"What obligations does the Contractor have to ensure its submitted Works Proposals meet all relevant legal and regulatory requirements set out in the Works Requirements?","68":"What obligations does the Contractor have to ensure that its submitted proposals for the project align with the specifications and requirements outlined in the contract agreement?","69":"How might the Contractor be informed of key deadlines and milestones originating from the ER (Evaluating Requirements)?","70":"What steps can be taken to guarantee the Contractor's preparedness for receiving the required information or completing the specific work task?","71":"How might we facilitate the Contractor's preparation in advance of receiving new data?","72":"What steps must the Contractor take to ensure transparency with the Emergency Room regarding its plans and arrangements?","73":"How can the Contractor guarantee that their compensation and working arrangements conform to relevant laws and terms outlined in any binding employment contract?","74":"What measures can the Contractor take to guarantee compliance with labor laws regarding compensation and work environment?","75":"What is the effect of replacing or amending an existing contract through a formal agreement?","76":"What steps would the ER need to take in order to have the Specialist removed from the site?","77":"What steps would the ER need to take in order to have the Specialist removed from the site?","78":"I see what's happening here! The original question is essentially asking for clarification on the same topic, which means it's redundant. However, to provide an answer in a different format, I can rephrase it as:\n\nWhat are the distinct characteristics of a design-build agreement versus a traditional construction contract?","79":"I'll assume you meant to ask for an alternative phrasing of \"What is the difference between a Design-Build (DB) contract and a Design-Build contract?\" Here's the rephrased version:\n\n\"What distinguishes a DB from another type of DB contract?\"\n\n(Note: I removed the duplicate phrase to make it more concise and clear.)","80":"What obligations does the contractor need to fulfill to guarantee that the project meets its intended functional requirements?","81":"How can the contractor guarantee that the completed project meets the required standards and functions as intended?","82":"What steps should be taken by the ER upon discovering a defect?","83":"What steps would the ER take if a flaw was discovered during its operation?","84":"How should the ER respond if a flaw is identified?","85":"How can the Emergency Room address issues related to product malfunctions or manufacturing errors? \n\n(Note: I've used synonyms like \"address\", \"issues\", and \"product malfunctions\" to rephrase the original question, while preserving its meaning and intent.)","86":"What happens to the project if the outstanding tasks are not finished on time?","87":"How many days do contractors typically require before notifying clients about the commencement of work?","88":"How long typically does it take for a construction subcontractor to formalize their official start date notification?","89":"What key inquiries should the hiring manager pose during the employment process?","90":"What steps must the ER take in order to put the Works on hold?","91":"What steps can the ER take to prevent or halt the progression of The Works?","92":"What individuals or entities are eligible for an extension of deadline as specified in section 9?","93":"What proportion of the available fund is still remaining in the Programme Contingency?","94":"What percentage of the program's reserve fund has been utilized?","95":"How quickly must an emergency room provider respond to a patient's assertion of injury or illness?","96":"How quickly must the ER submit its response to an invitation or proposal?","97":"How is the Emergency Room (ER) involved in processing delayed claims?","98":"What is the intended function or intention behind the Pricing Document?","99":"Who is entitled to receive compensation due to a delay in construction?","100":"What is the intended function or objective of this particular part of the content?","101":"What is the allotted timeframe for the ER to respond to an appeal?","102":"What is the typical timeframe for an emergency response in the ER?","103":"What process does the Electronic Records Retrieval (ERR) system employ to determine the outstanding balance for uncompleted or unfixed work order items?","104":"What is the methodology used by the ER to determine the outstanding balance for uncompleted tasks?","105":"Who is eligible to claim back the retention percentage from interim payments?","106":"What parties are eligible to claim a discount on the interim payments?","107":"What is the intended objective or function served by clause 5?","108":"What causes a contract to be terminated or broken?","109":"What grounds precipitate the end of a contractual agreement?","110":"What causes most contracts to be terminated?","111":"What are the outcomes resulting from dismissal due to non-payment?","112":"What should be the top priority for the Employer when bringing the project to completion?","113":"What should be the top priority for the Employer during the process of winding down operations?","114":"How should the Employer handle employee termination?","115":"How should the Employer proceed upon terminating the agreement?","116":"How should the Employer handle the situation following a breach or expiration of the employment contract?","117":"What steps can the Employer take if dismissal is not permissible under the law?","118":"What steps should the Employer take if they are unable to legally end the employment contract?","119":"What would be the repercussions if an entity fails to adhere to the requirements stipulated in the notice?","120":"What factors should influence the type of bond that the Contractor is required to provide in exchange for being paid based on the positive endorsement provided?","121":"What steps must a contractor take prior to signing an agreement?","122":"What preliminary steps must the contractor take prior to signing the contract?","123":"Before signing the agreement, what preliminary steps does the Contractor take to prepare for the project?","124":"What procedures or actions does the Contractor need to take in the event that they decide to cancel or terminate the services of a project supervisor?","125":"Who will oversee the accurate placement of every component in the Works?","126":"What tasks and obligations must the contractor undertake to successfully finish the project?","127":"What tasks and obligations must the contractor fulfill to successfully conclude the project?","128":"How might the Contractor's contractual responsibilities for completing the project be severed or discharged?","129":"Why wouldn't a guarantor be considered instead of the parent company when it has already been established as a responsible entity?","130":"What factors might influence the expense associated with planning, carrying out, and finishing the project?","131":"What factors might influence the expenses associated with planning, carrying out, and finishing the project?","132":"Who will oversee the supervisory role for either the implementation phase of the project or the initial planning and development stages?","133":"What is the estimated expense associated with hiring an interim or permanent replacement for a project supervisor position?","134":"What assurances and obligations does the Contractor undertake to provide to the Employer?","135":"What documentation or information must the Contractor provide to the Employer's designated representative?","136":"What documentation or information does the contractor provide to the Employer's designated representative?","137":"Who will oversee the precise placement of every component within the overall project?","138":"What documentation or assurances does the contractor need to submit to the employer prior to commencing work?","139":"What is typically provided by the contractor to the employer prior to the commencement of the agreement?","140":"What procedures would enable the employer to discharge their contractual obligations with respect to the completion of the project?","141":"What grounds exist for the contractor to forfeit his commitment to finish the project?","142":"What exactly does it mean for someone to take on the role of a guarantor?","143":"Who is the lead designer responsible for overseeing the project?","144":"How many communication alerts or warnings is the Employer entitled to receive?","145":"How many formal communications or warnings should be issued to the employer prior to submitting a tender proposal?","146":"What specifications or conditions must be met by a bill of quantities in a construction project?","147":"What duration of delayed workdays can be attributed to compensable interruptions?","148":"What number of working days were lost due to Compensable Events?","149":"What types of risks or losses are typically excluded from insurance coverage under the Works and other Risk Items clause?","150":"What is the bare minimum level of coverage needed for the project?","151":"What constitutes the financial burden or expense associated with a hold-up in project completion or delivery timeline?","152":"What is the time frame allotted for a contractor to submit a certification of substantial completion?","153":"How much time is typically allotted for a contractor to review and respond to a contract proposal?","154":"What is the typical duration or deadline for a contractor to fulfill their obligations under an agreement?","155":"What authority or organization is responsible for certifying that a project has reached substantial completion?","156":"What does it entail to incur a delay?","157":"Who serves as the representative of the employer?","158":"What is the main objective or goal that the contract aims to achieve?","159":"What is the identity of the chief executive officer at Build IT Ltd?","160":"What conditions must be met by a holding company to provide assurance to its subsidiary(s)?","161":"How can I obtain the necessary information regarding the procedures for issuing additional notifications to the Contractor in accordance with clauses 12 and 13?","162":"What are the specifications for notifying the contractor of additional communications or messages?","163":"What does \"part 1k\" refer to?","164":"How many days did the vessels designated as Tender Nr 1, Tender Nr 4, and Tender Nr 2 need to be delayed?","165":"What was the duration of the entire excavation project from start to finish?","166":"How many months did the excavation project span?","167":"How many hours did the archaeologist assigned to the project spend working on it? \n\n(I replaced \"Archaeology Specialist\" with \"archeologist\", and used more formal tone to maintain the same meaning and intent as the original question.)","168":"How long did the Archaeology Specialist dedicate to working on the project?","169":"How many hours of consulting did the Archaeology Specialist need to dedicate?","170":"What are the advantages and disadvantages of opting for either the permissive or restrictive approach in the proposed methodology?","171":"What are the advantages and disadvantages of adopting an open versus restrictive approach in your methodology or system?","172":"Does the BOQ contain a standard procedure for recalculating quantities to prevent mathematical discrepancies from occurring during inventory management?","173":"What distinguishes a parent company assurance from a surety bond?","174":"What sets apart a standard agreement from a Delegated Budget (DB) arrangement?","175":"What distinguishes a standard agreement from a database (DB) contract?","176":"What does the Road Traffic Act stipulate as the standard to determine whether a vehicle is suitable and effective for its intended use?","177":"What is the main intention or function of a Bill of Quantities?","178":"What is the intended function or objective served by the use of the Bill of Quantities?","179":"What alternatives to traditional methods exist for acquiring specialists?","180":"What is the meaning of an unpredictable event or circumstance that cannot be anticipated or foreseen?","181":"Is a financial incentive included to compensate for a loss incurred under a minor works contract?","182":"Does the Contractor's scope of work require them to rebuild the entire project site (the \"Works\") from scratch?","183":"What entities or concepts may be considered to represent two separate quantities or totals.","184":"What terms or provisions in a contract could potentially represent distinct totals?","185":"What does Section 9 intend to achieve?","186":"What does clause 10 serve or accomplish?","187":"What function do mediators or arbitrators typically perform in resolving conflicts between parties?","188":"Who is responsible for mediating disputes or resolving conflicts?","189":"What is the function or responsibility attributed to the Project Sponsor Development Program (PSDP) within the Works Requirements Document?","190":"What is the typical timeframe required for a contract to be finalized after initial agreement has been reached?","191":"How quickly can a written agreement be formally approved?","192":"What distinction exists between contractors and consultants in terms of contractual obligations under a Cooperative Employment Agreement (COE)?","193":"What distinguishes a hired professional from an expert who provides temporary guidance on a specific project or issue?"},"pertub_predicted":{"0":"The purpose of the public works contracts training manual is to improve management.\nThere are main topics in the public works construction contracts training manual.\nThe purpose of this manual is to help better management.\nThe purpose of the new forms of contract is to increase financial certainty.","1":"The purpose of the public works contracts training manual is to improve management.\nThe purpose of this manual is to help better management.\nThere are main topics in the public works construction contracts training manual.\nThe purpose of the new forms of contract is to increase financial certainty.","2":"The purpose of this manual is to help better management.\nThe issue instructions in writing are for employers.\nGood management can be aided by course purpose.\nThe purpose of the public works contracts training manual is to improve management.","3":"Good management can be aided by course purpose.\nThe purpose of this manual is to help better management.\nThe purpose of the capital works management framework is to ensure that there is an integrated methodology.\nThe purpose of the exercise is to challenge the groups.","4":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.\nThe contracts are written in plain English.","5":"The purpose of the exercise is to challenge the groups.\nKeep in focus and take action.\nSubstantial Completion is a change order.\nExtending the defects period is an action to take.","6":"The purpose of the capital works management framework is to ensure that there is an integrated methodology.\nThe purpose of the public works contracts training manual is to improve management.\nThe purpose of new construction contracts is to protect public funds.\nCivil engineering, traditional design and build are some of the public works contract features.","7":"The purpose of the new forms of contract is to increase financial certainty.\nThere are new forms of contract.\nThere are new forms of contract requirements.\nThe new contracts impact is the topic of the introduction.","8":"There are new forms of contract.\nCivil engineering, traditional design and build are some of the public works contract features.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.","9":"The purpose of the public works contracts training manual is to improve management.\nBackground information is contained in the public works tender document.\nCivil engineering, traditional design and build are some of the public works contract features.\nWhat is the difference between a traditional contract and a public works contract?","10":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.\nThe purpose of new construction contracts is to protect public funds.","11":"There are new forms of contract.\nThere are new forms of contract requirements.\nThere are new contract requirements for procurement of specialists.\nWhat is the difference between a traditional contract and a public works contract?","12":"There are variations in the Boq CORRECTION RULE.\nThe new forms difference is an understanding of the principles of risk assessment.\nThere are new forms of contract.\nWhat do the contractors have to do to keep the Er informed?","13":"Civil engineering, traditional design and build are some of the public works contract features.\nAppendix consents are required for the public works contract.\nWhat is the difference between a traditional contract and a public works contract?\nWhat is the difference between a design and construction contract and a public works contract?","14":"Mf is the structure of the contract.\nContractual obligation is the job of the employer.\nConditions of contract clause is for employers representative\nThere are conditions of contract for employers representative.","15":"There are new forms of contract.\nThere are new forms of contract requirements.\nThere is an understanding of the principles of risk assessment in new contracts.\nThe new contracts impact is the topic of the introduction.","16":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.\nThere is an understanding of the principles of risk assessment in new contracts.","17":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe new contracts impact is the topic of the introduction.\nThe purpose of the new forms of contract is to increase financial certainty.","18":"Health and safety are considered.\nAccepting the risk and managing contaminated soil is what stewardship is all about.\nIf the site becomes contaminated during the construction, ignore it and deal with it.\nArchaeological risk is the contracting authority's risk.","19":"Accepting the risk and managing contaminated soil is what stewardship is all about.\nIf the site becomes contaminated during the construction, ignore it and deal with it.\nWhat can be done to make sure the contractor is ready for the work?\nEnsure that the contractor is ready for the information by keeping all relevant documents on site.","20":"Accepting the risk and managing contaminated soil is what stewardship is all about.\nIf the site becomes contaminated during the construction, ignore it and deal with it.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nThe preliminary site investigation complaint is a framework.","21":"The purpose of new construction contracts is to protect public funds.\nUnforeseen utilities are included in the new design and build contract.\nCONTRACT FEATURE is the design of the contract.\nWhat is the difference between a design and construct contract and a design and construct contract?","22":"Delay or compensation event critique is a possibility.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nDelay relationship is a compensation event.\nWhat do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?","23":"Delay or compensation event critique is a possibility.\nDelay relationship is a compensation event.\nDelay cost deflation is a single rate.\nDelay compensation events are on site working days.","24":"Archaeological risk is the contracting authority's risk.\nThe contracting authority risks allOCATION is a contractor.\nThe employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?","25":"Archaeological risk is the contracting authority's risk.\nThe contracting authority risks allOCATION is a contractor.\nThere is an understanding of the principles of risk assessment in new contracts.\nThe employer is a contractor.","26":"Relocate utilities is the objective of the enabling works contract.\nThe Enabling Works Contract is the main contract.\nThe employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?","27":"There are main topics in the public works construction contracts training manual.\nThe purpose of the public works contracts training manual is to improve management.\nPricing risks are included in the Public Works Construction Contracts Training Manual.\nCivil engineering, traditional design and build are some of the public works contract features.","28":"There are risks to the procurement strategy.\nThe programme is called the procurement strategy influENCE.\nThere are new contract requirements for procurement of specialists.\nThe project is called Procurement Strategy Influence.","29":"There are conditions of contract for employers representative.\nThe Contractor enters a contract that is satisfactory.\nMf is the structure of the contract.\nThe employer is a contractor.","30":"CONTRACT FEATURE is the design of the contract.\nThere are new forms of contract.\nThere are new forms of contract requirements.\nThere are conditions of contract for employers representative.","31":"CONTRACT FEATURE is the design of the contract.\nThere are conditions of contract for employers representative.\nThere are new forms of contract requirements.\nThere are new forms of contract.","32":"There are main topics in the public works construction contracts training manual.\nPricing risks are included in the Public Works Construction Contracts Training Manual.\nThe purpose of the public works contracts training manual is to improve management.\nThe employer is a contractor.","33":"There are main topics in the public works construction contracts training manual.\nPricing risks are included in the Public Works Construction Contracts Training Manual.\nThe purpose of the public works contracts training manual is to improve management.\nThe employer is a contractor.","34":"There are risks to the procurement strategy.\nThe purpose of the exercise is to challenge the groups.\nAccepting the risk and managing contaminated soil is what stewardship is all about.\nLimitations on the employer's representative's authority is an issue intersectionality.","35":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.\nThere are new contract requirements for procurement of specialists.","36":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe new contracts impact is the topic of the introduction.\nThere are new contract requirements for procurement of specialists.","37":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe new contracts impact is the topic of the introduction.\nThere are new contract requirements for procurement of specialists.","38":"The programme is called the procurement strategy influENCE.\nThere are risks to the procurement strategy.\nThe purpose of new construction contracts is to protect public funds.\nThe purpose of the new forms of contract is to increase financial certainty.","39":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nThe rates of pay and conditions of employment have to be complied with.\nThe issue instructions in writing are for employers.","40":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nContractual obligation is the job of the employer.\nContractor TermiNATE OBLIGATION is an employer.","41":"Substantial Completion is a change order.\nWhat can be done to make sure the contractor is ready for the work?\nContractor return time is a certificate of completion.\nThe Contractor is responsible for the damage after the work has been completed.","42":"Mf is the structure of the contract.\nContractual obligation is the job of the employer.\nRecovery date is the contract purpose.\nMeat is the contract purpose.","43":"The formula fluectuations method works.\nFormula Fluctuations method of operation works.\nThe operation of hyperinflation is working.\nThe purpose of the new forms of contract is to increase financial certainty.","44":"Formula Fluctuations method of operation works.\nThe formula fluectuations method works.\nThe operation of hyperinflation is working.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.","45":"Interim certificate is for Wyzp RECOVERY PERCENTAGE.\nThe maximum percentage is the employer calculation rule.\nThere is an employer deferral right.\nThe purpose of new construction contracts is to protect public funds.","46":"The operation of hyperinflation is working.\nThe formula fluectuations method works.\nFormula Fluctuations method of operation works.\nThe maximum percentage is the employer calculation rule.","47":"Post tender clarifications are what the letter of acceptance is for.\nThe willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nThe Parent Company is the guarantor.\nThe contracting authority risks allOCATION is a contractor.","48":"Post tender clarifications are what the letter of acceptance is for.\nBackground information is contained in the public works tender document.\nThe willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nThe new contracts impact is the topic of the introduction.","49":"Mf is the structure of the contract.\nContractual obligation is the job of the employer.\nRecovery date is the contract purpose.\nMeat is the contract purpose.","50":"Part 1K is a portion of the works.\nContractor return time is a certificate of completion.\nSubstantial Completion is a change order.\nThe Contractor is responsible for the damage after the work has been completed.","51":"Extending the defects period is an action to take.\nThe employer's response time is 20 working days.\nWhat can be done to make sure the contractor is ready for the work?\n20 working days is the working hours of an archaeology specialist.","52":"The employer's response time is 20 working days.\nContractor return time is a certificate of completion.\n20 working days is the working hours of an archaeology specialist.\nSubstantial Completion is a change order.","53":"There is a minimum insurance limit in the schedule.\nDelay relationship is a compensation event.\nThe days of deferral are site working days.","54":"The purpose of the public works contracts training manual is to improve management.\nThere are main topics in the public works construction contracts training manual.\nThe purpose of new construction contracts is to protect public funds.\nRelocate utilities is the objective of the enabling works contract.","55":"Civil engineering, traditional design and build are some of the public works contract features.\nAppendix consents are required for the public works contract.\nThe employer is a contractor.\nThe Contractor must propose a change to the works proposals.","56":"What does a Novation of a contract mean?\nThe project supervisor is Novation And Guarantee Deed.\nNovation is a non preferred form of Procuring Specialists.\nRecovery date is the contract purpose.","57":"Background information is contained in the public works tender document.\nAppendix consents are required for the public works contract.\nCivil engineering, traditional design and build are some of the public works contract features.\nThere are main topics in the public works construction contracts training manual.","58":"The purpose of new construction contracts is to protect public funds.\nContractual obligation is the job of the employer.\nContractor return time is a contract.\nWhat is the difference between a design and construction contract and a public works contract?","59":"The purpose of new construction contracts is to protect public funds.\nUnforeseen utilities are included in the new design and build contract.\nDesign and build route is a form of contract.\nRecovery date is the contract purpose.","60":"Contractual obligation is the job of the employer.\nThe employer is a contractor.\nThe contractor is the thing that has to be submitted to the employer.\nThe contractor is the company that gives the job to the employee.","61":"The Contractor is responsible for the damage after the work has been completed.\nPart 1K is a portion of the works.\nThe parent company is the contractor.\nThe complete works of the contractor are being done regularly.","62":"What is the difference between a traditional contract and a public works contract?\nWhat is the difference between a design and construction contract and a public works contract?\nThe purpose of new construction contracts is to protect public funds.\nWhat is the difference between a design and construct contract and a design and construct contract?","63":"There is a minimum insurance limit in the schedule.\nThe minimum insurance amount is 2,800 per day.\nThe minimum insurance limit is known as SubClause 3.7.\nWhat is the difference between professional and personal insurance?","64":"There is a minimum insurance limit in the schedule.\nThe minimum insurance limit is known as SubClause 3.7.\nThe minimum insurance amount is 2,800 per day.\nThere is a fixed price for the new contracts challenge.","65":"What is the difference between professional and personal insurance?\nThere is a minimum insurance limit in the schedule.\nThe minimum insurance limit is known as SubClause 3.7.\nThe contractor is the thing that has to be submitted to the employer.","66":"The employer is a contractor.\nMinimise Delay And Compensation Events And Their Effects is what a co insured contractor does.\nThe responsibilities of the contractor are monitor, spot check and audit.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.","67":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe employer is a contractor.\nEstablish a quality control system is the responsibility of the contractor.\nThe responsibilities of the contractor are monitor, spot check and audit.","68":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nWhat can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.\nThe responsibilities of the contractor are monitor, spot check and audit.\nEstablish a quality control system is the responsibility of the contractor.","69":"What can be done to make sure that the contractor is aware of all relevant dates?\nWhat do the contractors have to do to keep the Er informed?\nWhat can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.","70":"What can be done to make sure the contractor is ready for the work?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nThe employer is a contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.","71":"What can be done to make sure the contractor is ready for the work?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nThe employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?","72":"What do the contractors have to do to keep the Er informed?\nWhat can be done to make sure the contractor is ready for the work?\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nThe employer is a contractor.","73":"What do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?\nThe rates of pay and conditions of employment have to be complied with.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nContractor compensation is the job of the contractor.\nThe employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nThe contractor must give notice to the employer.","74":"What do the contractors have to do to make sure the rates of pay and conditions of employment are in line with the law?\nThe rates of pay and conditions of employment have to be complied with.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nContractor compensation is the job of the contractor.\nThe employer is a contractor.","75":"There are new forms of contract.\nWhat does a Novation of a contract mean?\nThere are new forms of contract requirements.\nThe contractor has a change order representation warrant.","76":"If he wants to remove the specialist from the site, what should he do?\nWhat do the contractors have to do to keep the Er informed?\nThere are new contract requirements for procurement of specialists.\nThe action to take is to issue a direction to the contractor to stop the work.","77":"If he wants to remove the specialist from the site, what should he do?\nWhat do the contractors have to do to keep the Er informed?\nThere are new contract requirements for procurement of specialists.\nThe action to take is to issue a direction to the contractor to stop the work.","78":"What is the difference between a design and construct contract and a design and construct contract?\nWhat is the difference between a design and construction contract and a public works contract?\nThe employer is a contractor.\nWhat is the difference between a traditional contract and a public works contract?","79":"What is the difference between a design and construct contract and a design and construct contract?\nCONTRACT FEATURE is the design of the contract.\nWhat is the difference between a design and construction contract and a public works contract?\nCivil engineering, traditional design and build are some of the public works contract features.","80":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nWhat can be done to make sure the contractor is ready for the work?\nEstablish a quality control system is the responsibility of the contractor.\nThe employer is a contractor.\nThe responsibilities of the contractor are monitor, spot check and audit.\nComplying with its obligations under the construction regulations is what datememe is for.","81":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nEstablish a quality control system is the responsibility of the contractor.\nThe responsibilities of the contractor are monitor, spot check and audit.","82":"Extending the defects period is an action to take.\nWhat do the contractors have to do to keep the Er informed?\nIf he wants to remove the specialist from the site, what should he do?\nRejecting the works or the relevant section is the action to take.","83":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nRejecting the works or the relevant section is the action to take.\nThe action to take is to issue a direction to the contractor to stop the work.","84":"What do the contractors have to do to keep the Er informed?\nExtending the defects period is an action to take.\nIf he wants to remove the specialist from the site, what should he do?\nThe purpose of the hospital wing is refurbished.","85":"What do the contractors have to do to keep the Er informed?\nThe purpose of the hospital wing is refurbished.\nAn existing hospital wing is to be refurbished.\nWhat can be done to make sure that the contractor is aware of all relevant dates?","86":"What do the contractors have to do to keep the Er informed?\nThe action to take is to issue a direction to the contractor to stop the work.\nRejecting the works or the relevant section is the action to take.\nExtending the defects period is an action to take.","87":"The employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?\nContractor return time is a contract.\nNotices are sent to the employer before the job is done.","88":"Notices are sent to the employer before the job is done.\nThe contractor must give notice to the employer.\nThe employer is a contractor.\nContractor return time is a contract.","89":"There are risks to the procurement strategy.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nWhat can be done to make sure the contractor is ready for the work?\nLimitations on the employer's representative's authority is an issue intersectionality.","90":"The action to take is to issue a direction to the contractor to stop the work.\nRejecting the works or the relevant section is the action to take.\nWhat do the contractors have to do to keep the Er informed?\nIf he wants to remove the specialist from the site, what should he do?","91":"The action to take is to issue a direction to the contractor to stop the work.\nWhat do the contractors have to do to keep the Er informed?\nWhat can be done to make sure the contractor is ready for the work?\nRejecting the works or the relevant section is the action to take.","92":"Extending the defects period is an action to take.\nDelay or compensation event critique is a possibility.\nThe Expiry Date of the Bond is Proposed.\nComplying with its obligations under the construction regulations is what datememe is for.","93":"The maximum percentage is the employer calculation rule.\nThe purpose of the new forms of contract is to increase financial certainty.\nThe purpose of new construction contracts is to protect public funds.\nThe minimum insurance amount is 2,800 per day.","94":"The maximum percentage is the employer calculation rule.\nThe programme is called the procurement strategy influENCE.\nThe purpose of the new forms of contract is to increase financial certainty.\nThere are variations in the Boq CORRECTION RULE.","95":"The employer's response time is 20 working days.\nExtending the defects period is an action to take.\nWhat do the contractors have to do to keep the Er informed?\nIf he wants to remove the specialist from the site, what should he do?","96":"The employer's response time is 20 working days.\nGive at least 15 working days notice.\nWhat do the contractors have to do to keep the Er informed?\n50 days is the duration of the tender.","97":"What do the contractors have to do to keep the Er informed?\nDelay or compensation event critique is a possibility.\nGive at least 15 working days notice.\nDelay compensation events are on site working days.","98":"A basis of assessment is the purpose of the pricing document.\nBackground information is contained in the public works tender document.\nThere is a fixed price for the new contracts challenge.\nThe parent company is the contractor.","99":"Delay or compensation event critique is a possibility.\nThere is an employer deferral right.\nDelay compensation events are on site working days.\nThe Contractor is responsible for the damage after the work has been completed.","100":"Part 1K is a portion of the works.\nThe purpose of this manual is to help better management.\nGood management can be aided by course purpose.\nA basis of assessment is the purpose of the pricing document.","101":"The employer's response time is 20 working days.\nGive at least 15 working days notice.\nWhat do the contractors have to do to keep the Er informed?\n50 days is the duration of the tender.","102":"The employer's response time is 20 working days.\nGive at least 15 working days notice.\nWhat do the contractors have to do to keep the Er informed?\n20 working days is the working hours of an archaeology specialist.","103":"There is an employer compliance requirement.\nDelay compensation events are on site working days.\nRemeasurement of work no longer applies to the bill of quantities function.\nThere are variations in the Boq CORRECTION RULE.","104":"The issue instructions in writing are for employers.\nThe maximum percentage is the employer calculation rule.\nThere are conditions of contract for employers representative.\nThere is an employer compliance requirement.","105":"There is an employer deferral right.\nThe maximum percentage is the employer calculation rule.\nInterim certificate is for Wyzp RECOVERY PERCENTAGE.\nThe employer is a contractor.","106":"There is an employer deferral right.\nInterim certificate is for Wyzp RECOVERY PERCENTAGE.\nThe contractor is the thing that has to be submitted to the employer.\nThe cost of consent is the contractor.","107":"Conditions of contract clause is for employers representative\nContractual obligation is the job of the employer.\nMf is the structure of the contract.\nThere are notice provisions for employer noncompliance.","108":"There are conditions of contract for employers representative.\nMf is the structure of the contract.\nConditions of contract clause is for employers representative\nThere are new forms of contract.","109":"Termination action is taken by an employer.\nThere are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nComplying With Contractual Obligations is a failure by the contractor.","110":"Termination action is taken by an employer.\nThere are conditions of contract for employers representative.\nContractual obligation is the job of the employer.\nConditions of contract clause is for employers representative","111":"Termination action is taken by an employer.\nThere are notice provisions for employer noncompliance.\nThere is an employer compliance requirement.\nContractual obligation is the job of the employer.","112":"What can be done to make sure the contractor is ready for the work?\nThe issue instructions in writing are for employers.\nContractual obligation is the job of the employer.\nTermination action is taken by an employer.","113":"Termination action is taken by an employer.\nContractual obligation is the job of the employer.\nThe issue instructions in writing are for employers.\nThere are conditions of contract for employers representative.","114":"Termination action is taken by an employer.\nThe issue instructions in writing are for employers.\nGive at least 15 working days notice.\nConditions of contract clause is for employers representative","115":"Termination action is taken by an employer.\nContractual obligation is the job of the employer.\nContractor TermiNATE OBLIGATION is an employer.\nConditions of contract clause is for employers representative","116":"Termination action is taken by an employer.\nContractual obligation is the job of the employer.\nThere are conditions of contract for employers representative.\nThere is an employer compliance requirement.","117":"Termination action is taken by an employer.\nThere is an employer deferral right.\nThe issue instructions in writing are for employers.\nThere is an employer compliance requirement.","118":"Termination action is taken by an employer.\nThere are conditions of contract for employers representative.\nContractual obligation is the job of the employer.\nThere is an employer compliance requirement.","119":"There are notice provisions for employer noncompliance.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nGive at least 15 working days notice.\nWhat do the contractors have to do to keep the Er informed?","120":"Contractor compensation is the job of the contractor.\nThe employer is a contractor.\nThe contractor is the thing that has to be submitted to the employer.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.","121":"What can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nThe contractor must give notice to the employer.","122":"What can be done to make sure the contractor is ready for the work?\nThe employer is a contractor.\nWhat do the contractors have to do to keep the Er informed?\nThe contractor must give notice to the employer.","123":"What can be done to make sure the contractor is ready for the work?\nWhat do the contractors have to do to keep the Er informed?\nThe Contractor enters a contract that is satisfactory.\nThe contractor is the thing that has to be submitted to the employer.","124":"The employer is a contractor.\nIf he wants to remove the specialist from the site, what should he do?\nThe action to take is to issue a direction to the contractor to stop the work.\nWhat do the contractors have to do to keep the Er informed?","125":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nStructural Engineer was appointed to the project.\nThe project supervisor is Novation And Guarantee Deed.","126":"The responsibilities of the contractor are monitor, spot check and audit.\nThe employer is a contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe Contractor enters a contract that is satisfactory.","127":"The employer is a contractor.\nThe responsibilities of the contractor are monitor, spot check and audit.\nWhat can be done to make sure the contractor is ready for the work?\nContractor compensation is the job of the contractor.","128":"The employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?\nContractor compensation is the job of the contractor.\nComplying with its obligations under the construction regulations is what datememe is for.","129":"The Parent Company is the guarantor.\nIt is not a robust guarantee.\nThere is no Parent Company Guarantee requirement.","130":"The employer is a contractor.\nThe contractor's cost is the cost of appointing and fees and expenses.\nContractor compensation is the job of the contractor.\nEstablish a quality control system is the responsibility of the contractor.","131":"There are risks to the procurement strategy.\nThe project is called Procurement Strategy Influence.\nThe employer is a contractor.\nThe contractor's cost is the cost of appointing and fees and expenses.","132":"The project supervisor is Novation And Guarantee Deed.\nStructural Engineer was appointed to the project.\nDesign and build route is a form of contract.\nComplying with its obligations under the construction regulations is what datememe is for.","133":"The employer is a contractor.\nThere are new contract requirements for procurement of specialists.\nThere is a fixed price for the new contracts challenge.\nThe contractor's cost is the cost of appointing and fees and expenses.","134":"The employer is a contractor.\nContractual obligation is the job of the employer.\nThere are conditions of contract for employers representative.\nContractor compensation is the job of the contractor.","135":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nThe contractor is the thing that has to be submitted to the employer.\nThe employer is a contractor.","136":"There are conditions of contract for employers representative.\nThe contractor is the thing that has to be submitted to the employer.\nThe employer is a contractor.\nConditions of contract clause is for employers representative","137":"What can be done to make sure the contractor is ready for the work?\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nStructural Engineer was appointed to the project.\nThe project supervisor is Novation And Guarantee Deed.","138":"What can be done to make sure the contractor is ready for the work?\nThe contractor is the thing that has to be submitted to the employer.\nThe contractor must give notice to the employer.\nThere are conditions of contract for employers representative.\nThe employer is a contractor.\nThere is an employer compliance requirement.","139":"What can be done to make sure the contractor is ready for the work?\nThe contractor is the thing that has to be submitted to the employer.\nThe contractor must give notice to the employer.\nThere are conditions of contract for employers representative.\nThere is an employer compliance requirement.","140":"The employer is a contractor.\nComplying with its obligations under the construction regulations is what datememe is for.\nContractor compensation is the job of the contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.","141":"The employer is a contractor.\nContractor compensation is the job of the contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nContractor return time is a contract.","142":"It is not a robust guarantee.\nThe Parent Company is the guarantor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe project supervisor is Novation And Guarantee Deed.","143":"Structural Engineer was appointed to the project.\nDesign and build route is a form of contract.\nUnforeseen utilities are included in the new design and build contract.\nThe project supervisor is Novation And Guarantee Deed.","144":"The issue instructions in writing are for employers.\nGive at least 15 working days notice.\nLimitations on the employer's representative's authority is an issue intersectionality.\nThere are risks to the procurement strategy.","145":"Notices are sent to the employer before the job is done.\nThe notices are for the employer.\nThere are notice provisions for employer noncompliance.\nThere is an employer compliance requirement.","146":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nWhat can be done to make sure the contractor is ready for the work?\nRemeasurement of work no longer applies to the bill of quantities function.","147":"Delay or compensation event critique is a possibility.\nDelay compensation events are on site working days.\nThe days of deferral are site working days.\nThe employer's response time is 20 working days.","148":"Delay relationship is a compensation event.\nDelay compensation events are on site working days.\nDelay or compensation event critique is a possibility.\nThe days of deferral are site working days.","149":"Exclusions are allowed for terrorism cover.\nThere is an employer compliance requirement.\nThe change order compliance requirements are works.\nThe new forms difference is an understanding of the principles of risk assessment.","150":"There is a minimum insurance limit in the schedule.\nThe minimum insurance amount is 2,800 per day.\nThe minimum insurance limit is known as SubClause 3.7.\nThe purpose of new construction contracts is to protect public funds.","151":"Delay or compensation event critique is a possibility.\nDelay relationship is a compensation event.\nDelay cost deflation is a single rate.\nThe project is called Procurement Strategy Influence.","152":"Contractor return time is a certificate of completion.\nComplying with its obligations under the construction regulations is what datememe is for.\nThe employer is a contractor.\nContractor return time is a contract.","153":"Contractor return time is a contract.\nThe employer is a contractor.\nGive at least 15 working days notice.\nThe Contractor enters a contract that is satisfactory.","154":"Contractor return time is a contract.\nThe employer is a contractor.\nComplying with its obligations under the construction regulations is what datememe is for.\nContractor compensation is the job of the contractor.","155":"Contractor return time is a certificate of completion.\nSubstantial Completion is a change order.\nThe contracting authority risks allOCATION is a contractor.\nThe Contractor is responsible for the damage after the work has been completed.","156":"Delay cost deflation is a single rate.\nDelay relationship is a compensation event.\nDelay or compensation event critique is a possibility.\nMinimise Delay And Compensation Events And Their Effects is what a co insured contractor does.","157":"Contractual obligation is the job of the employer.\nThe issue instructions in writing are for employers.\nThe notices are for the employer.\nThere is an employer compliance requirement.","158":"Contractual obligation is the job of the employer.\nRecovery date is the contract purpose.\nMf is the structure of the contract.\nMeat is the contract purpose.","159":"Mr Peter Rock is the Managing Director of Identity.\nThe project supervisor is Novation And Guarantee Deed.\nStructural Engineer was appointed to the project.\nDesign and build route is a form of contract.","160":"The Parent Company is the guarantor.\nThere is no Parent Company Guarantee requirement.\nThe minimum insurance amount is 2,800 per day.\nThe minimum insurance limit is known as SubClause 3.7.","161":"The employer is a contractor.\nThe contractor must give notice to the employer.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nWhat do the contractors have to do to keep the Er informed?","162":"What can be done to make sure that the contractor is aware of all relevant dates?\nWhat do the contractors have to do to keep the Er informed?\nThe employer is a contractor.\nWhat can be done to make sure the contractor is ready for the work?","163":"Part 1K is a portion of the works.\nThere is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nThe minimum insurance limit is known as SubClause 3.7.","164":"50 days is the duration of the tender.\nGive at least 15 working days notice.\nThe willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nBackground information is contained in the public works tender document.","165":"Excavations are a whole month.\nContractor return time is a certificate of completion.\n20 working days is the working hours of an archaeology specialist.\nPart 1K is a portion of the works.","166":"Excavations are a whole month.\n20 working days is the working hours of an archaeology specialist.\nContractor return time is a certificate of completion.\nThe days of deferral are site working days.","167":"20 working days is the working hours of an archaeology specialist.\nAn archaeology specialist works two hours a day.\nStructural Engineer was appointed to the project.\nExcavations are a whole month.","168":"20 working days is the working hours of an archaeology specialist.\nAn archaeology specialist works two hours a day.\nExcavations are a whole month.\nStructural Engineer was appointed to the project.","169":"20 working days is the working hours of an archaeology specialist.\nAn archaeology specialist works two hours a day.\nIf he wants to remove the specialist from the site, what should he do?\nExcavations are a whole month.","170":"What is the difference between a traditional contract and a public works contract?\nGuidance note on the works contracts is open or restricted procedures.\nNovation is a non preferred form of Procuring Specialists.\nThe purpose of the capital works management framework is to ensure that there is an integrated methodology.","171":"Guidance note on the works contracts is open or restricted procedures.\nThe new forms difference is an understanding of the principles of risk assessment.\nThere is an understanding of the principles of risk assessment in new contracts.\nWhat is the difference between a traditional contract and a public works contract?","172":"There are variations in the Boq CORRECTION RULE.\nIt is not a robust guarantee.\nThere is a bill of quantities requirements.\nThe change order compliance requirements are works.","173":"The Parent Company is the guarantor.\nIt is not a robust guarantee.\nThere is no Parent Company Guarantee requirement.\nWhat is the difference between a traditional contract and a public works contract?","174":"There are new forms of contract.\nThere are new forms of contract requirements.\nThe purpose of the new forms of contract is to increase financial certainty.\nContractual obligation is the job of the employer.","175":"There are new forms of contract.\nMf is the structure of the contract.\nThere are new forms of contract requirements.\nThere are conditions of contract for employers representative.","176":"The willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nThe minimum insurance limit is known as SubClause 3.7.\nThere are new forms of contract requirements.\nThere are conditions of contract for employers representative.","177":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nRemeasurement of work no longer applies to the bill of quantities function.\nUnforeseen utilities are included in the new design and build contract.","178":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nBackground information is contained in the public works tender document.\nRemeasurement of work no longer applies to the bill of quantities function.","179":"Novation is a non preferred form of Procuring Specialists.\nThere are new contract requirements for procurement of specialists.\nThere are risks to the procurement strategy.\nThe programme is called the procurement strategy influENCE.","180":"Delay relationship is a compensation event.\nUnforeseen utilities are included in the new design and build contract.\nWhat can be done to make sure that the contractor is aware of all relevant dates?\nThe days of deferral are site working days.","181":"Conditions of contract clause is for employers representative\nDelay relationship is a compensation event.\nComplying With Contractual Obligations is a failure by the contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.","182":"The Contractor must propose a change to the works proposals.\nThe employer is a contractor.\nThe Contractor is responsible for making sure that the works proposals comply with the requirements.\nThe contractor has a change order representation warrant.","183":"There is a bill of quantities requirements.\nThe method of measurement is called Bill of Quantities REQUIREMENTS.\nThe formula fluectuations method works.\nFormula Fluctuations method of operation works.","184":"There are conditions of contract for employers representative.\nConditions of contract clause is for employers representative\nMf is the structure of the contract.\nThere are new forms of contract.","185":"The willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nThe purpose of this manual is to help better management.\nA basis of assessment is the purpose of the pricing document.\nThe purpose of new construction contracts is to protect public funds.","186":"The willingness of the contracting authority to consider the tender in question is 'fit for purpose' in the road traffic act.\nConditions of contract clause is for employers representative\nLimitations on the employer's representative's authority is an issue intersectionality.\nClause 12.2 is the employer's compliance.","187":"Conditions of contract clause is for employers representative\nThe issue instructions in writing are for employers.\nThere are conditions of contract for employers representative.\nThe Contractor enters a contract that is satisfactory.","188":"Conditions of contract clause is for employers representative\nIf he wants to remove the specialist from the site, what should he do?\nThere are conditions of contract for employers representative.\nThe issue instructions in writing are for employers.","189":"The Contractor is responsible for making sure that the works proposals comply with the requirements.\nBackground information is contained in the public works tender document.\nThe contractor is the thing that has to be submitted to the employer.\nThe Contractor must propose a change to the works proposals.","190":"There are conditions of contract for employers representative.\nContractor return time is a contract.\nThere are new forms of contract requirements.\nContractual obligation is the job of the employer.","191":"Mf is the structure of the contract.\nThere are new forms of contract requirements.\nThere are new forms of contract.\nWhat can be done to make sure that the contractor is aware of all relevant dates?","192":"The employer is a contractor.\nThe contractor is the company that gives the job to the employee.\nThe Contractor enters a contract that is satisfactory.\nCompetent person is what the definition of a contractor's personnel is.","193":"What is the difference between professional and personal insurance?\nWhat is the difference between a traditional contract and a public works contract?\nContractual obligation is the job of the employer.\nWhat is the difference between a design and construct contract and a design and construct contract?"},"pertub_eval":{"0":"Yes","1":"Yes","2":"Yes","3":"Yes","4":"Yes","5":"Yes","6":"Yes","7":"Yes","8":"Yes","9":"No","10":"Yes","11":"No","12":"Yes","13":"Yes","14":"Yes","15":"Yes","16":"Yes","17":"Yes","18":"Yes","19":"Yes","20":"Yes","21":"Yes","22":"Yes","23":"Yes","24":"No","25":"Yes","26":"Yes","27":"Yes","28":"Yes","29":"Yes","30":"Yes","31":"Yes","32":"No","33":"Yes","34":"Yes","35":"Yes","36":"Yes","37":"Yes","38":"Yes","39":"Yes","40":"Yes","41":"Yes","42":"Yes","43":"Yes","44":"Yes","45":"Yes","46":"Yes","47":"Yes","48":"Yes","49":"Yes","50":"Yes","51":"No","52":"No","53":"Yes","54":"Yes","55":"Yes","56":"No","57":"Yes","58":"No","59":"No","60":"Yes","61":"Yes","62":"Yes","63":"Yes","64":"Yes","65":"No","66":"Yes","67":"Yes","68":"Yes","69":"Yes","70":"Yes","71":"Yes","72":"Yes","73":"Yes","74":"Yes","75":"Yes","76":"Yes","77":"Yes","78":"Yes","79":"No","80":"Yes","81":"Yes","82":"Yes","83":"Yes","84":"No","85":"No","86":"Yes","87":"No","88":"Yes","89":"Yes","90":"Yes","91":"Yes","92":"Yes","93":"Yes","94":"No","95":"No","96":"Yes","97":"Yes","98":"Yes","99":"Yes","100":"Yes","101":"Yes","102":"No","103":"No","104":"No","105":"Yes","106":"Yes","107":"Yes","108":"Yes","109":"Yes","110":"Yes","111":"Yes","112":"Yes","113":"Yes","114":"Yes","115":"Yes","116":"Yes","117":"Yes","118":"Yes","119":"No","120":"Yes","121":"Yes","122":"Yes","123":"Yes","124":"Yes","125":"Yes","126":"Yes","127":"Yes","128":"No","129":"Yes","130":"Yes","131":"Yes","132":"Yes","133":"Yes","134":"Yes","135":"Yes","136":"Yes","137":"Yes","138":"Yes","139":"No","140":"Yes","141":"Yes","142":"Yes","143":"Yes","144":"No","145":"Yes","146":"Yes","147":"Yes","148":"Yes","149":"Yes","150":"Yes","151":"Yes","152":"Yes","153":"Yes","154":"Yes","155":"Yes","156":"Yes","157":"Yes","158":"Yes","159":"Yes","160":"Yes","161":"Yes","162":"Yes","163":"Yes","164":"Yes","165":"Yes","166":"Yes","167":"Yes","168":"Yes","169":"No","170":"No","171":"No","172":"Yes","173":"Yes","174":"Yes","175":"Yes","176":"Yes","177":"Yes","178":"Yes","179":"Yes","180":"No","181":"Yes","182":"Yes","183":"Yes","184":"Yes","185":"Yes","186":"Yes","187":"Yes","188":"Yes","189":"Yes","190":"Yes","191":"No","192":"Yes","193":"Yes"}}