{"query":{"0":"What is the purpose of the Public Works Contracts Training Manual?","1":"What is the purpose of the Public Works Contracts training manual?","2":"What is the purpose of this manual?","3":"What is the purpose of the course?","4":"What are the main features of the new forms of contract?","5":"What is the purpose of the exercise?","6":"What is the purpose of the Capital Works Management Framework?","7":"What is the purpose of the new forms of contract?","8":"What are the new forms of construction contracts?","9":"What is the purpose of the new forms of construction contracts for public works?","10":"What is the purpose of the new forms of construction contracts?","11":"What are the key differences between the new contracts and those previously used in their sectors?","12":"What are the key differences between the new forms and those previously used?","13":"What are the main features of a public works contract?","14":"What are the main features of a contract?","15":"What are the key changes from the old contracts?","16":"What are the key changes from the Old Contracts?","17":"What are the key changes from the old contract?","18":"What can be done to reduce the risk of contaminated soil?","19":"What is the best way to deal with a contaminated site?","20":"What is the best way to deal with contaminated soil?","21":"What does the new design-and-build contract mean?","22":"What is the definition of a delay or compensation event?","23":"What is the definition of a delay?","24":"How should a Contracting Authority allocate archaeological risk to the Contractor?","25":"How should a Contracting Authority allocate archaeological risk to a contractor?","26":"What is the purpose of a enabling works contract?","27":"What are the main topics of the Public Works Construction Contracts Training Manual?","28":"What are the most important factors to consider when selecting a procurement strategy?","29":"What should be considered when deciding on a form of contract?","30":"What should be considered when deciding on the form of contract?","31":"What should be considered when deciding which form of contract?","32":"What are some of the issues that need to be considered in the Public Works Construction Contracts Training Manual?","33":"What are some of the issues that need to be considered in the Public Works Construction Contracts training manual?","34":"What are the main issues that need to be considered?","35":"What are the main changes in the new forms of contract?","36":"What are the main issues that arise with the introduction of the new contracts?","37":"What are the main issues that arise with the introduction of new contracts?","38":"What does the Department of Finance National Public Procurement Policy Unit do?","39":"What are the duties of the Employers Representative under the Conditions of Contract Clause?","40":"What are the duties of the Employers Representative under the Conditions of Contract?","41":"What do you do after Substantial Completion?","42":"What is the purpose of the contract?","43":"How does the Formula Fluctuations Method (PV2) work?","44":"How does the Formula Fluctuations Method work?","45":"How much of the WYZP will be recovered in an interim certificate?","46":"How does the Hyperinflation Formula work?","47":"What is the purpose of the Letter of Acceptance?","48":"What does the Letter of Acceptance say about post tender clarifications?","49":"What is the purpose of the contract?","50":"How long does it take for a Section to be completed?","51":"How long does it take to carry out a snagging job?","52":"How long does it take to carry out the snagging?","53":"What is the definition of \"weather event\" in the Schedule?","54":"What is the purpose of a Public Works Construction Contracts Training Manual?","55":"What are the requirements for a public works contract?","56":"what does a novation and guarantee deed mean?","57":"What type of information should be included in the Public Works Tender Document?","58":"What is the purpose of a construction contract?","59":"What is the purpose of the construction contract?","60":"What is the definition of a contractor's personnel?","61":"Who is responsible for damage to the Works after Substantial Completion?","62":"What is the difference between a traditional contract and a public works contract?","63":"What is the minimum indemnity limit in respect of Public Liability insurance?","64":"What is the minimum indemnity limit in the Schedule?","65":"What is the difference between a professional indemnity and a personal indemnity?","66":"What does a co-insured contractor do?","67":"What is the responsibility of the Contractor to make sure that the Works Proposals comply with the Works Requirements or Legal Requirements?","68":"What is the responsibility of the Contractor to make sure that the Works Proposals comply with the Works Requirements?","69":"What can be done to ensure that the Contractor is aware of all relevant dates from the ER?","70":"What can be done to ensure that the Contractor is ready for the information or the works item?","71":"What can be done to ensure that the Contractor is ready for the information?","72":"What does the Contractor have to do to keep the ER fully informed about its arrangements?","73":"What does the Contractor have to do to ensure that rates of pay and conditions of employment comply with law and with any registered employment agreement?","74":"What does the Contractor have to do to ensure that rates of pay and conditions of employment comply with law?","75":"What does a novation of a contract mean?","76":"What does the ER have to do if he wants to remove the Specialist from the Site?","77":"What does the ER have to do if he wants to remove the Specialist from the site?","78":"What is the difference between a design and construction contract and a design and construction contract?","79":"What is the difference between a Design and Construct Contract and a Design and Construct Contract?","80":"What does the contractor have to do to ensure that the Works are fit for the purpose for which they were designed?","81":"What does the contractor have to do to ensure that the Works are fit for their intended purpose?","82":"What does the ER have to do if a defect is found?","83":"What does the ER have to do if a defect is found in the Works?","84":"What does the ER have to do if a defect is discovered?","85":"What can the ER do to deal with defects?","86":"What does the ER do when the works are not completed?","87":"How long does it take for a contractor to give notice of the starting date?","88":"How long does it take for a contractor to give notice of the Starting Date?","89":"What questions should the employer ask the Employer to consider?","90":"What does the ER have to do to suspend the Works?","91":"What does the ER have to do to stop the Works proceeding?","92":"Who is entitled to an extension of time under clause 9?","93":"How much of the Programme Contingency has been used up?","94":"How much of the Programme Contingency is used up?","95":"How long does the ER have to respond to a claim?","96":"How long does the ER have to respond to a proposal?","97":"What does the ER have to do in relation to delay claims?","98":"What is the purpose of the Pricing Document?","99":"Who is to be compensated for a delay in construction?","100":"What is the purpose of this section?","101":"How long does the ER have to respond to a claim?","102":"How long does the ER have to respond?","103":"How does the ER calculate the amount due for unfixed works items?","104":"How does the ER calculate the amount due for unfixed works?","105":"Who is entitled to deduct the retention percentage from Interim Payments?","106":"Who is entitled to deduct the retention percentage from the Interim Payments?","107":"what is the purpose of sub-clause 5?","108":"What are the reasons for a termination of a contract?","109":"What are the reasons for termination of a contract?","110":"What are the main reasons for termination of a contract?","111":"What are the consequences of termination for default?","112":"What is the most important thing that the Employer should do when completing the Works?","113":"What is the most important thing that the Employer should do when terminating the Works?","114":"What should the Employer do in the event of a termination?","115":"What should the Employer do in the event of a termination of the Contract?","116":"What should the Employer do in the event of a termination of the contract?","117":"What should the Employer do if he is not entitled to terminate?","118":"What should the Employer do if he is not entitled to terminate the Contract?","119":"What are the consequences of not complying with the notice provisions?","120":"What should be considered when considering the form of bond to be furnished by the Contractor in exchange for payment on foot of the recommendation?","121":"What does the contractor do before entering into the Contract?","122":"what does the contractor do before entering into the Contract?","123":"what does the Contractor do before entering into the Contract?","124":"What does the Contractor do if it terminates the appointment of a project supervisor?","125":"Who will be responsible for the correct positioning of all parts of the Works?","126":"what does the contractor have to do in order to complete the Works?","127":"what does the contractor have to do in order to complete the works?","128":"What can be done to terminate the Contractors obligation to complete the Works?","129":"Why not a guarantor if the parent company has been identified?","130":"what could affect the cost of designing, executing and completing the works?","131":"what could affect the cost of designing, executing and completing the Works?","132":"Who is to be appointed project supervisor for the construction stage or the design process?","133":"what is the cost of a replacement project supervisor?","134":"What does the Contractor represent and warrant to the Employer?","135":"What does the Contractor submit to the Employers Representative?","136":"What does the contractor submit to the Employers Representative?","137":"Who shall be responsible for the correct positioning of all parts of the Works?","138":"what does the contractor give to the Employer before the starting date?","139":"what does the contractor give to the Employer before the Contract Date?","140":"How can the employer terminate the Contractors obligation to complete the Works?","141":"How can the contractor terminate his obligation to complete the Works?","142":"How can a guarantor be a guarantor?","143":"Who is the Architect appointed to the project?","144":"How many notices can be sent to the Employer?","145":"How many notices should be sent to the Employer before Tender?","146":"What are the requirements of the Bill of Quantities?","147":"How many days of delay caused by compensation events?","148":"How many days of delay caused by Compensation Events?","149":"What are the permitted exclusions from insurance of the Works and other Risk Items?","150":"What is the minimum amount of insurance required for the works?","151":"what is a delay cost?","152":"How long does a contractor have to return a certificate of substantial completion?","153":"How long does a contractor have to return a contract?","154":"How long does a contractor have to return to a contract?","155":"Who is required to issue the certificate of Substantial Completion of the Works?","156":"What is a delay cost?","157":"Who is the Employers Representative?","158":"What is the purpose of the contract?","159":"Who is the Managing Director of Build IT Ltd?","160":"What are the requirements for a parent company guarantee?","161":"What are the details for sending other notices to the Contractor under clause 12 or 13?","162":"What are the details for sending other notices to the Contractor?","163":"what is part 1k?","164":"How many days did the Tender Nr 1 Tender Nr 1 Tender Nr 4 Tender Nr 2 have to be delayed?","165":"How long did it take for the excavations to be completed?","166":"How long did it take to complete the excavations?","167":"How many hours did the Archaeology Specialist have to work on the project?","168":"How many hours did the Archaeology Specialist need to work on the project?","169":"How many hours did the Archaeology Specialist have to provide?","170":"what are the relative merits of using the Open or Restricted procedures?","171":"what are the relative merits of using the open or restricted procedures?","172":"Is there a rule for rebalancing items in the BOQ to ensure arithmetic errors are corrected?","173":"What is the difference between a parent company guarantee and a performance bond?","174":"What is the difference between a traditional contract and a DB contract?","175":"What is the difference between a traditional and a DB contract?","176":"What is the definition of 'fit for purpose' in the Road Traffic Act?","177":"What is the purpose of a Bill of Quantities?","178":"What is the purpose of the Bill of Quantities?","179":"What is a non preferred form of procuring Specialists?","180":"What does the definition of unforeseeable mean?","181":"Is there a bonus provision for a loss in a minor works contract?","182":"Does the Contractor have to re-build the Works?","183":"What can be interpreted as referring to two different sums?","184":"What can be interpreted as referring to two different sums in a contract?","185":"What is the purpose of Clause 9?","186":"What is the purpose of the clause 10?","187":"What is the role of a conciliator?","188":"What is the role of the Conciliator?","189":"What is the role of the PSDP in the Works Requirements?","190":"How long does it take to get the contract signed?","191":"How long does it take to get a contract signed?","192":"What is the difference between a contractor and a consultant under the COE?","193":"What is the difference between a contractor and a consultant?"},"expected":{"0":"Enablers for Better Management","1":"Enablers for Better Management","2":"Enablers for Better Management 3","3":"an enabler for good management","4":"MF • Structure of the contract","5":"to challenge the groups to consider","6":"to ensure that there is an integrated methodology","7":"maximising financial certainty by risk allocation","8":"to be used without amendments","9":"to protect public funds","10":"to protect public funds","11":"An understanding of the principles of risk assessment and appropriate risk allocation","12":"An understanding of the principles of risk assessment and appropriate risk allocation","13":"building or civil engineering, traditional or design and build","14":"Contractor’s design","15":"The contracts are written in plain English","16":"The contracts are written in plain English","17":"The contracts are written in plain English","18":"Accepting the Risk and Managing It An existing hospital wing is to be refurbished","19":"Ignore it and deal with it if and when it arises during the construction","20":"Accepting the Risk and Managing It An existing hospital wing is to be refurbished","21":"Unforeseeable utilities","22":"Where \"Yes\" is inserted in a box","23":"compensation event as appropriate","24":"when, having completed a preliminary site investigation in compliance with the NMS Framework","25":"when, having completed a preliminary site investigation in compliance with the NMS Framework","26":"to relocate utilities in advance of the main contract","27":"Works building or civil engineering in nature","28":"the nature of the project, its risks and the programme available","29":"whether to follow the traditional or design and build route Example","30":"whether to follow the traditional or design and build route Example","31":"the programme for a project","32":"Limitations on the Employer's Representative's authority","33":"Limitations on the Employer's Representative's authority","34":"archaeology, ground conditions and utilities","35":"The suitability assessment and procurement of specialists","36":"Tenders are procured on a fixed price lump sum basis","37":"Tenders are procured on a fixed price lump sum basis","38":"Public Works Construction Contracts Training Manual 9 Contract Administration","39":"Issue instructions in writing","40":"Issue instructions in writing","41":"Give a change order where physically impossible or contrary to Legal Requirements to complete Works","42":"activates a Recovery Date","43":"he only recovers the amount in","44":"he only recovers the amount in","45":"ie 10%","46":"mathematically the same","47":"provides for the incorporation into the Contract of post tender clarifications","48":"provides for the incorporation into the Contract","49":"overall design","50":"a minimum period","51":"18 months","52":"over 18 months","53":"rainfall, air temperature and wind speed","54":"to enable him to price the risks being imposed on him","55":"Appendix Consents a. Planning and other consents obtained by the Employer","56":"appointment of project supervisor for construction stage","57":"relevant background information","58":"Training Manual Electrical installation","59":"Training Manual Electrical installation","60":"competent person","61":"The Contractor","62":"professional fees","63":"sub-clause 3.7","64":"sub-clause 3.7","65":"an aggregate sum for each year","66":"minimise delay and Compensation Events and their effects","67":"the Contractor must propose a change to the Works Proposals","68":"the Contractor must propose a change to the Works Proposals","69":"by which such items will be required well in advance","70":"keep all relevant documents on Site including contract documents","71":"keep all relevant documents on Site including contract documents","72":"in advance and about their implementation","73":"give a certificate","74":"comply with","75":"transfer","76":"perform and observe him","77":"perform and observe him","78":"it would obviously be of far greater significance","79":"it would obviously be of far greater significance","80":"monitor, spot check and audit","81":"establish a quality control system","82":"reject the Works or the relevant Section","83":"reject the Works or the relevant Section","84":"reject the Works or the relevant Section","85":"extend the Defects Period","86":"give at least 15 working days notice","87":"by Friday 7 June","88":"by Friday 7 June","89":"Health and Safety","90":"issue a direction to the Contractor to suspend all or part of the Works","91":"issue a direction to the Contractor to suspend all or part of the Works","92":"the ER","93":"how much","94":"how much","95":"20 working days","96":"20 working days","97":"keep in focus","98":"a basis of assessment","99":"Contractor","100":"making of claims by the Employer against the Contractor","101":"20 working days","102":"20 working days","103":"up to a maximum percentage of their value as set out in the Schedule","104":"up to a maximum percentage of their value as set out in the Schedule","105":"The Employer","106":"The Employer","107":"The Employer has no liability for matters not set out in the final statement","108":"Failure by Contractor to comply with contractual obligations","109":"Failure by Contractor to comply with contractual obligations","110":"Failure by Contractor to comply with contractual obligations","111":"clause 12.2","112":"ensure that all Works Items necessary for completion of the Works are kept on Site","113":"ensure that all Works Items necessary for completion of the Works are kept on Site","114":"terminate the Contractor’s obligation to complete the Works for default","115":"terminate the Contractor’s obligation to complete the Works for default","116":"terminate the Contractor’s obligation to complete the Works for default","117":"address this situation","118":"address this situation","119":"disentitle him in respect of his delay and\/or compensation claim","120":"proposed expiry date of the bond","121":"satisfied itself","122":"satisfied itself","123":"satisfied itself","124":"comply with its obligations under the Construction Regulations in connection with that appointment","125":"The Contractor","126":"proceed regularly and diligently","127":"proceed regularly and diligently","128":"by notice to the Employer","129":"for purposes of pre- qualification","130":"Consent","131":"Consent","132":"the Contractor","133":"cost of appointing and fees and expenses","134":"a Change Order","135":"any required Works Item or other thing","136":"any required Works Item or other thing","137":"The Contractor","138":"Contract","139":"all of the following, all executed, as relevant, by the relevant persons","140":"by notice to the Employer","141":"by notice to the Employer","142":"if parent company has been identified for purposes of pre- qualification","143":"The Structural Engineer","144":"12 and 13","145":"12 and 13","146":"the method of measurement according to which it was prepared and measurements","147":"Site Working Days","148":"Site Working Days","149":"terrorism cover","150":"€2,800 per day","151":"single rate","152":"12 months","153":"12 months","154":"12 months","155":"The Employer’s Representative","156":"single rate","157":"Justin Wright Ltd","158":"MEAT","159":"Mr Peter Rock","160":"If none named, no parent company guarantee required","161":"20 The Heights LA Town Co LA","162":"Co LA","163":"Period\/portion of the Works","164":"50 Days","165":"a whole month","166":"a whole month","167":"two","168":"two","169":"20 working days","170":"Guidance Note on the Works Contracts","171":"Guidance Note on the Works Contracts","172":"Variants","173":"not a robust guarantee","174":"It is not necessarily appropriate to automatically seek PI cover from a Contractor","175":"It is not necessarily appropriate to automatically seek PI cover from a Contractor","176":"the willingness of the contracting authority to consider the tender in question","177":"remeasurement of work no longer applies","178":"remeasurement of work no longer applies","179":"Novation","180":"having inspected the site and surroundings","181":"he is not entitled to an adjustment of the Contract Sum","182":"if for instance they are burned down due to no fault of his","183":"paragraph","184":"paragraph","185":"give the appropriate notice","186":"give a certificate","187":"a competent person","188":"a competent person","189":"Temporary Works Designer as a Specialist","190":"6 months","191":"6 months","192":"reasonable skill and care","193":"Contractor has protection of the Contract"}}